MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_rcc.h
  * @brief   Header file of RCC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_RCC_H
#define STM32C5XX_LL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup RCC_LL RCC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Constants RCC Private Constants
  * @{
  */
/* Constants for LL_CLKSOURCE_xxx() macros
   31           24            16           8             0
   --------------------------------------------------------
   | Register    | Bit         |  Bit       | ClkSource   |
   | Offset      | Position    | Mask       | Config      |
   --------------------------------------------------------*/

/* Clock source register offset Vs CCIPR1 register */
#define RCC_OFFSET_CCIPR1       0x00UL
#define RCC_OFFSET_CCIPR2       0x04UL
#define RCC_OFFSET_CCIPR3       0x08UL

#define LL_RCC_CONFIG_SHIFT 0UL
#define LL_RCC_MASK_SHIFT   8UL
#define LL_RCC_POS_SHIFT    16UL
#define LL_RCC_REG_SHIFT    24UL

/**
  * @}
  */ /* End of RCC_LL_Private_Constants */

/* Private macros ------------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Macros RCC Private Macros
  * @{
  */
#if !defined(UNUSED)
#define UNUSED(x) ((void)(x))
#endif /* UNUSED */

#define LL_CLKSOURCE_POS(__clksource__)     (((__clksource__) >> LL_RCC_POS_SHIFT) & 0x1FUL)
#define LL_CLKSOURCE_MASK(__clksource__)    ((((__clksource__) >> LL_RCC_MASK_SHIFT) & 0xFFUL) << \
                                             LL_CLKSOURCE_POS(__clksource__))
#define LL_CLKSOURCE_CONFIG(__clksource__)  ((((__clksource__) >> LL_RCC_CONFIG_SHIFT) & 0xFFUL) << \
                                             LL_CLKSOURCE_POS(__clksource__))
#define LL_CLKSOURCE_REG(__clksource__)     (((__clksource__) >> LL_RCC_REG_SHIFT) & 0xFFUL)

#define LL_CLKSOURCE(__reg__, __pos__, __msk__, __clk__) ((uint32_t)((((__msk__) >> (__pos__)) << LL_RCC_MASK_SHIFT) | \
                                                                     (( __pos__              ) << LL_RCC_POS_SHIFT)  | \
                                                                     (( __reg__              ) << LL_RCC_REG_SHIFT)  | \
                                                                     (((__clk__) >> (__pos__)) << LL_RCC_CONFIG_SHIFT)))
/**
  * @}
  */ /* RCC_LL_Private_Macros */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Constants LL RCC Constants
  * @{
  */

/** @defgroup RCC_LL_EC_LSE LSE oscillator driving capability
  * @{
  */
#define LL_RCC_LSEDRIVE_LOW               0U                       /*!< Xtal mode lower driving capability       */
#define LL_RCC_LSEDRIVE_MEDIUMLOW         RCC_RTCCR_LSEDRV_0       /*!< Xtal mode medium low driving capability  */
#define LL_RCC_LSEDRIVE_MEDIUMHIGH        RCC_RTCCR_LSEDRV_1       /*!< Xtal mode medium high driving capability */
#define LL_RCC_LSEDRIVE_HIGH              RCC_RTCCR_LSEDRV         /*!< Xtal mode higher driving capability      */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSEEXT External LSE mode
  * @{
  */
#define LL_RCC_LSE_ANALOG_MODE            0U                       /*!< ANALOG  clock used as LSE external clock source  */
#define LL_RCC_LSE_DIGITAL_MODE           RCC_RTCCR_LSEEXT         /*!< DIGITAL clock used as LSE external clock source  */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_HSEEXT EXTERNAL HSE Mode
  * @{
  */
#define LL_RCC_HSE_ANALOG_MODE            0U                       /*!< HSE clock used as ANALOG clock source  */
#define LL_RCC_HSE_DIGITAL_MODE           RCC_CR1_HSEEXT           /*!< HSE clock used as DIGITAL clock source */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSCO_CLKSOURCE  LSCO Selection
  * @{
  */
#define LL_RCC_LSCO_CLKSOURCE_LSI         0U                       /*!< LSI selection for low speed clock  */
#define LL_RCC_LSCO_CLKSOURCE_LSE         RCC_RTCCR_LSCOSEL        /*!< LSE selection for low speed clock  */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_HSIK HSI kernel clock out divider factor
  * @{
  */
#define LL_RCC_HSIK_DIV_1                 RCC_CR2_HSIKDIV_0                                           /*!< HSI kernel clock divided by 1   */
#define LL_RCC_HSIK_DIV_1_5               RCC_CR2_HSIKDIV_1                                           /*!< HSI kernel clock divided by 1.5 */
#define LL_RCC_HSIK_DIV_2                 (RCC_CR2_HSIKDIV_1 | RCC_CR2_HSIKDIV_0)                     /*!< HSI kernel clock divided by 2   */
#define LL_RCC_HSIK_DIV_2_5               RCC_CR2_HSIKDIV_2                                           /*!< HSI kernel clock divided by 2.5 */
#define LL_RCC_HSIK_DIV_3                 (RCC_CR2_HSIKDIV_2 | RCC_CR2_HSIKDIV_0)                     /*!< HSI kernel clock divided by 3   */
#define LL_RCC_HSIK_DIV_3_5               (RCC_CR2_HSIKDIV_2 | RCC_CR2_HSIKDIV_1)                     /*!< HSI kernel clock divided by 3.5 */
#define LL_RCC_HSIK_DIV_4                 (RCC_CR2_HSIKDIV_2 | RCC_CR2_HSIKDIV_1 | RCC_CR2_HSIKDIV_0) /*!< HSI kernel clock divided by 4   */
#define LL_RCC_HSIK_DIV_4_5               RCC_CR2_HSIKDIV_3                                           /*!< HSI kernel clock divided by 4.5 */
#define LL_RCC_HSIK_DIV_5                 (RCC_CR2_HSIKDIV_3 | RCC_CR2_HSIKDIV_0)                     /*!< HSI kernel clock divided by 5   */
#define LL_RCC_HSIK_DIV_5_5               (RCC_CR2_HSIKDIV_3 | RCC_CR2_HSIKDIV_1)                     /*!< HSI kernel clock divided by 5.5 */
#define LL_RCC_HSIK_DIV_6                 (RCC_CR2_HSIKDIV_3 | RCC_CR2_HSIKDIV_1 | RCC_CR2_HSIKDIV_0) /*!< HSI kernel clock divided by 6   */
#define LL_RCC_HSIK_DIV_6_5               (RCC_CR2_HSIKDIV_3 | RCC_CR2_HSIKDIV_2)                     /*!< HSI kernel clock divided by 6.5 */
#define LL_RCC_HSIK_DIV_7                 (RCC_CR2_HSIKDIV_3 | RCC_CR2_HSIKDIV_2 | RCC_CR2_HSIKDIV_0) /*!< HSI kernel clock divided by 7   */
#define LL_RCC_HSIK_DIV_7_5               (RCC_CR2_HSIKDIV_3 | RCC_CR2_HSIKDIV_2 | RCC_CR2_HSIKDIV_1) /*!< HSI kernel clock divided by 7.5 */
#define LL_RCC_HSIK_DIV_8                 RCC_CR2_HSIKDIV                                             /*!< HSI kernel clock divided by 8   */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PSIK PSI kernel clock out divider factor
  * @{
  */
#define LL_RCC_PSIK_DIV_1                 RCC_CR2_PSIKDIV_0                                           /*!< PSI kernel clock divided by 1   */
#define LL_RCC_PSIK_DIV_1_5               RCC_CR2_PSIKDIV_1                                           /*!< PSI kernel clock divided by 1.5 */
#define LL_RCC_PSIK_DIV_2                 (RCC_CR2_PSIKDIV_1 | RCC_CR2_PSIKDIV_0)                     /*!< PSI kernel clock divided by 2   */
#define LL_RCC_PSIK_DIV_2_5               RCC_CR2_PSIKDIV_2                                           /*!< PSI kernel clock divided by 2.5 */
#define LL_RCC_PSIK_DIV_3                 (RCC_CR2_PSIKDIV_2 | RCC_CR2_PSIKDIV_0)                     /*!< PSI kernel clock divided by 3   */
#define LL_RCC_PSIK_DIV_3_5               (RCC_CR2_PSIKDIV_2 | RCC_CR2_PSIKDIV_1)                     /*!< PSI kernel clock divided by 3.5 */
#define LL_RCC_PSIK_DIV_4                 (RCC_CR2_PSIKDIV_2 | RCC_CR2_PSIKDIV_1 | RCC_CR2_PSIKDIV_0) /*!< PSI kernel clock divided by 4   */
#define LL_RCC_PSIK_DIV_4_5               RCC_CR2_PSIKDIV_3                                           /*!< PSI kernel clock divided by 4.5 */
#define LL_RCC_PSIK_DIV_5                 (RCC_CR2_PSIKDIV_3 | RCC_CR2_PSIKDIV_0)                     /*!< PSI kernel clock divided by 5   */
#define LL_RCC_PSIK_DIV_5_5               (RCC_CR2_PSIKDIV_3 | RCC_CR2_PSIKDIV_1)                     /*!< PSI kernel clock divided by 5.5 */
#define LL_RCC_PSIK_DIV_6                 (RCC_CR2_PSIKDIV_3 | RCC_CR2_PSIKDIV_1 | RCC_CR2_PSIKDIV_0) /*!< PSI kernel clock divided by 6   */
#define LL_RCC_PSIK_DIV_6_5               (RCC_CR2_PSIKDIV_3 | RCC_CR2_PSIKDIV_2)                     /*!< PSI kernel clock divided by 6.5 */
#define LL_RCC_PSIK_DIV_7                 (RCC_CR2_PSIKDIV_3 | RCC_CR2_PSIKDIV_2 | RCC_CR2_PSIKDIV_0) /*!< PSI kernel clock divided by 7   */
#define LL_RCC_PSIK_DIV_7_5               (RCC_CR2_PSIKDIV_3 | RCC_CR2_PSIKDIV_2 | RCC_CR2_PSIKDIV_1) /*!< PSI kernel clock divided by 7.5 */
#define LL_RCC_PSIK_DIV_8                 RCC_CR2_PSIKDIV                                             /*!< PSI kernel clock divided by 8   */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PSIFREQ PSI target frequency configuration
  * @{
  */
#define LL_RCC_PSIFREQ_100MHZ              0U                                           /*!< PSI output frequency is 100 MHz */
#define LL_RCC_PSIFREQ_144MHZ              RCC_CR2_PSIFREQ_0                            /*!< PSI output frequency is 144 MHz */
#define LL_RCC_PSIFREQ_160MHZ              RCC_CR2_PSIFREQ_1                            /*!< PSI output frequency is 160 MHz */
/**
  * @}
  */

