MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/** @defgroup RCC_LL_EC_PSIREF PSI ref clock frequency selection
  * @{
  */
#define LL_RCC_PSIREF_32768HZ             0U                                      /*!< PSI reference clock input is 32768 Hz */
#define LL_RCC_PSIREF_8MHZ                RCC_CR2_PSIREF_0                        /*!< PSI reference clock input is 8 MHz    */
#define LL_RCC_PSIREF_16MHZ               RCC_CR2_PSIREF_1                        /*!< PSI reference clock input is 16 MHz   */
#define LL_RCC_PSIREF_24MHZ               (RCC_CR2_PSIREF_1 | RCC_CR2_PSIREF_0)   /*!< PSI reference clock input is 24 MHz   */
#define LL_RCC_PSIREF_25MHZ               RCC_CR2_PSIREF_2                        /*!< PSI reference clock input is 25 MHz   */
#define LL_RCC_PSIREF_32MHZ               (RCC_CR2_PSIREF_2 | RCC_CR2_PSIREF_0)   /*!< PSI reference clock input is 32 MHz   */
#define LL_RCC_PSIREF_48MHZ               (RCC_CR2_PSIREF_2  | RCC_CR2_PSIREF_1)  /*!< PSI reference clock input is 48 MHz   */
#define LL_RCC_PSIREF_50MHZ               RCC_CR2_PSIREF                          /*!< PSI reference clock input is 50 MHz   */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PSIREFSRC PSI ref clock source selection
  * @{
  */
#define LL_RCC_PSISOURCE_HSE              0U                       /*!< PSI source is HSE */
#define LL_RCC_PSISOURCE_LSE              RCC_CR2_PSIREFSRC_0      /*!< PSI source is LSE */
#define LL_RCC_PSISOURCE_HSIDIV18         RCC_CR2_PSIREFSRC_1      /*!< PSI source is HSI divided by 18 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYS_CLKSOURCE  System clock switch
  * @{
  */
#define LL_RCC_SYS_CLKSOURCE_HSIDIV3      0U                       /*!< HSI DIV3 clock selection as system clock */
#define LL_RCC_SYS_CLKSOURCE_HSIS         RCC_CFGR1_SW_0           /*!< HSIS clock selection as system clock     */
#define LL_RCC_SYS_CLKSOURCE_HSE          RCC_CFGR1_SW_1           /*!< HSE oscillator selection as system clock */
#define LL_RCC_SYS_CLKSOURCE_PSIS         RCC_CFGR1_SW             /*!< PSIS clock selection as system clock     */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYS_CLKSOURCE_STATUS  System clock switch status
  * @{
  */
#define LL_RCC_SYS_CLKSOURCE_STATUS_HSIDIV3 0U                     /*!< HSI DIV3 clock used as system clock */
#define LL_RCC_SYS_CLKSOURCE_STATUS_HSIS    RCC_CFGR1_SWS_0        /*!< HSIS clock used as system clock     */
#define LL_RCC_SYS_CLKSOURCE_STATUS_HSE     RCC_CFGR1_SWS_1        /*!< HSE oscillator used as system clock */
#define LL_RCC_SYS_CLKSOURCE_STATUS_PSIS    RCC_CFGR1_SWS          /*!< PSIS clock used as system clock     */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_DIV  AHB prescaler
  * @{
  */
#define LL_RCC_HCLK_PRESCALER_1       0U                                                           /*!< SYSCLK not divided    */
#define LL_RCC_HCLK_PRESCALER_2       RCC_CFGR2_HPRE_3                                             /*!< SYSCLK divided by 2   */
#define LL_RCC_HCLK_PRESCALER_4       (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_0)                        /*!< SYSCLK divided by 4   */
#define LL_RCC_HCLK_PRESCALER_8       (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_1)                        /*!< SYSCLK divided by 8   */
#define LL_RCC_HCLK_PRESCALER_16      (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_0)     /*!< SYSCLK divided by 16  */
#define LL_RCC_HCLK_PRESCALER_64      (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2)                        /*!< SYSCLK divided by 64  */
#define LL_RCC_HCLK_PRESCALER_128     (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_0)     /*!< SYSCLK divided by 128 */
#define LL_RCC_HCLK_PRESCALER_256     (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_1)     /*!< SYSCLK divided by 256 */
#define LL_RCC_HCLK_PRESCALER_512     RCC_CFGR2_HPRE                                               /*!< SYSCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSTICK_CLKSOURCE  SYSTICK clock source selection
  * @{
  */
#define LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8    0U                       /*!< HCLKDIV8 clock used as SYSTICK clock source */
#define LL_RCC_SYSTICK_CLKSOURCE_LSI         RCC_CCIPR2_SYSTICKSEL_0  /*!< LSI clock used as SYSTICK clock source      */
#define LL_RCC_SYSTICK_CLKSOURCE_LSE         RCC_CCIPR2_SYSTICKSEL_1  /*!< LSE clock used as SYSTICK clock source      */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB1_DIV  APB low-speed prescaler (APB1)
  * @{
  */
#define LL_RCC_APB1_PRESCALER_1            0U                                                          /*!< HCLK not divided   */
#define LL_RCC_APB1_PRESCALER_2            RCC_CFGR2_PPRE1_2                                           /*!< HCLK divided by 2  */
#define LL_RCC_APB1_PRESCALER_4            (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_0)                     /*!< HCLK divided by 4  */
#define LL_RCC_APB1_PRESCALER_8            (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1)                     /*!< HCLK divided by 8  */
#define LL_RCC_APB1_PRESCALER_16           (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1 | RCC_CFGR2_PPRE1_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB2_DIV  APB high-speed prescaler (APB2)
  * @{
  */
#define LL_RCC_APB2_PRESCALER_1            0U                                                          /*!< HCLK not divided   */
#define LL_RCC_APB2_PRESCALER_2            RCC_CFGR2_PPRE2_2                                           /*!< HCLK divided by 2  */
#define LL_RCC_APB2_PRESCALER_4            (RCC_CFGR2_PPRE2_2 | RCC_CFGR2_PPRE2_0)                     /*!< HCLK divided by 4  */
#define LL_RCC_APB2_PRESCALER_8            (RCC_CFGR2_PPRE2_2 | RCC_CFGR2_PPRE2_1)                     /*!< HCLK divided by 8  */
#define LL_RCC_APB2_PRESCALER_16           (RCC_CFGR2_PPRE2_2 | RCC_CFGR2_PPRE2_1 | RCC_CFGR2_PPRE2_0) /*!< HCLK divided by 16 */
/**
  * @}
  */


/** @defgroup RCC_LL_EC_APB3_DIV  APB high-speed prescaler (APB3)
  * @{
  */
#define LL_RCC_APB3_PRESCALER_1            0U                                                          /*!< HCLK not divided   */
#define LL_RCC_APB3_PRESCALER_2            RCC_CFGR2_PPRE3_2                                           /*!< HCLK divided by 2  */
#define LL_RCC_APB3_PRESCALER_4            (RCC_CFGR2_PPRE3_2 | RCC_CFGR2_PPRE3_0)                     /*!< HCLK divided by 4  */
#define LL_RCC_APB3_PRESCALER_8            (RCC_CFGR2_PPRE3_2 | RCC_CFGR2_PPRE3_1)                     /*!< HCLK divided by 8  */
#define LL_RCC_APB3_PRESCALER_16           (RCC_CFGR2_PPRE3_2 | RCC_CFGR2_PPRE3_1 | RCC_CFGR2_PPRE3_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

