MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/** @defgroup RCC_LL_EC_STOP_WAKEUPCLOCK  System clock selection after a wakeup from system Stop
  * @{
  */
#define LL_RCC_STOP_WAKEUPCLOCK_HSIDIV3      0U                      /*!< HSIDIV3 selection after wake-up from STOP */
#define LL_RCC_STOP_WAKEUPCLOCK_HSIS         RCC_CFGR1_STOPWUCK      /*!< HSIS selection after wake-up from STOP    */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO1SOURCE  MCO1 SOURCE selection
  * @{
  */
#define LL_RCC_MCO1SOURCE_SYSCLK             (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | 0x00000000U)                                                       /*!< SYSCLK selection as MCO1 source           */
#define LL_RCC_MCO1SOURCE_HSE                (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | RCC_CFGR1_MCO1SEL_0)                                               /*!< HSE selection as MCO1 source              */
#define LL_RCC_MCO1SOURCE_LSE                (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | RCC_CFGR1_MCO1SEL_1)                                               /*!< LSE selection as MCO1 source              */
#define LL_RCC_MCO1SOURCE_LSI                (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | RCC_CFGR1_MCO1SEL_1 | RCC_CFGR1_MCO1SEL_0)                         /*!< LSI selection as MCO1 source              */
#define LL_RCC_MCO1SOURCE_PSIK               (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | RCC_CFGR1_MCO1SEL_2)                                               /*!< PSI kernel clock selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_HSIK               (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | RCC_CFGR1_MCO1SEL_2 | RCC_CFGR1_MCO1SEL_0)                         /*!< HSI kernel clock selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_PSIS               (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | RCC_CFGR1_MCO1SEL_2| RCC_CFGR1_MCO1SEL_1)                          /*!< PSIS selection as MCO1 source             */
#define LL_RCC_MCO1SOURCE_HSIS               (uint32_t)((RCC_CFGR1_MCO1SEL>>16U) | RCC_CFGR1_MCO1SEL_2 | RCC_CFGR1_MCO1SEL_1 | RCC_CFGR1_MCO1SEL_0 )  /*!< HSIS selection as MCO1 source             */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO2SOURCE  MCO2 SOURCE selection
  * @{
  */
#define LL_RCC_MCO2SOURCE_SYSCLK             (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | 0x00000000U)                                                       /*!< SYSCLK selection as MCO2 source           */
#define LL_RCC_MCO2SOURCE_HSE                (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | RCC_CFGR1_MCO2SEL_0)                                               /*!< HSE selection as MCO2 source              */
#define LL_RCC_MCO2SOURCE_LSE                (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | RCC_CFGR1_MCO2SEL_1)                                               /*!< LSE selection as MCO2 source              */
#define LL_RCC_MCO2SOURCE_LSI                (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | RCC_CFGR1_MCO2SEL_1| RCC_CFGR1_MCO2SEL_0)                          /*!< LSI selection as MCO2 source              */
#define LL_RCC_MCO2SOURCE_PSIK               (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | RCC_CFGR1_MCO2SEL_2)                                               /*!< PSI kernel clock selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_HSIK               (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | RCC_CFGR1_MCO2SEL_2 | RCC_CFGR1_MCO2SEL_0)                         /*!< HSI kernel clock selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_PSIDIV3            (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | RCC_CFGR1_MCO2SEL_2 | RCC_CFGR1_MCO2SEL_1)                         /*!< PSI DIV 3 selection as MCO2 source        */
#define LL_RCC_MCO2SOURCE_HSIDIV3            (uint32_t)((RCC_CFGR1_MCO2SEL>>16U) | RCC_CFGR1_MCO2SEL_2 | RCC_CFGR1_MCO2SEL_1 | RCC_CFGR1_MCO2SEL_0 )  /*!< HSI DIV 3 selection as MCO2 source        */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO1_DIV  MCO1 prescaler
  * @{
  */
#define LL_RCC_MCO1SOURCE_NOCLOCK                  (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | 0x00000000U)                                                       /*!< MCO1 output disabled, no clock on MCO1 */
#define LL_RCC_MCO1_PRESCALER_1                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_0)                                               /*!< MCO1 not divided   */
#define LL_RCC_MCO1_PRESCALER_2                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_1)                                               /*!< MCO1 divided by 2  */
#define LL_RCC_MCO1_PRESCALER_3                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_0 | RCC_CFGR1_MCO1PRE_1)                         /*!< MCO1 divided by 3  */
#define LL_RCC_MCO1_PRESCALER_4                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_2)                                               /*!< MCO1 divided by 4  */
#define LL_RCC_MCO1_PRESCALER_5                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_0)                         /*!< MCO1 divided by 5  */
#define LL_RCC_MCO1_PRESCALER_6                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_1)                         /*!< MCO1 divided by 6  */
#define LL_RCC_MCO1_PRESCALER_7                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_1 | RCC_CFGR1_MCO1PRE_0)   /*!< MCO1 divided by 7  */
#define LL_RCC_MCO1_PRESCALER_8                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_3)                                               /*!< MCO1 divided by 8  */
#define LL_RCC_MCO1_PRESCALER_9                    (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_3 | RCC_CFGR1_MCO1PRE_0)                         /*!< MCO1 divided by 9  */
#define LL_RCC_MCO1_PRESCALER_10                   (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_3 | RCC_CFGR1_MCO1PRE_1)                         /*!< MCO1 divided by 10 */
#define LL_RCC_MCO1_PRESCALER_11                   (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_3 | RCC_CFGR1_MCO1PRE_1 | RCC_CFGR1_MCO1PRE_0)   /*!< MCO1 divided by 11 */
#define LL_RCC_MCO1_PRESCALER_12                   (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_3 | RCC_CFGR1_MCO1PRE_2)                         /*!< MCO1 divided by 12 */
#define LL_RCC_MCO1_PRESCALER_13                   (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_3 | RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_0)   /*!< MCO1 divided by 13 */
#define LL_RCC_MCO1_PRESCALER_14                   (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE_3 | RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_1)   /*!< MCO1 divided by 14 */
#define LL_RCC_MCO1_PRESCALER_15                   (uint32_t)((RCC_CFGR1_MCO1PRE>>16U) | RCC_CFGR1_MCO1PRE)                                                 /*!< MCO1 divided by 15 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO2_DIV  MCO2 prescaler
  * @{
  */
#define LL_RCC_MCO2SOURCE_NOCLOCK                  (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | 0x00000000U)                                                       /*!< MCO2 output disabled, no clock on MCO2 */
#define LL_RCC_MCO2_PRESCALER_1                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_0)                                               /*!< MCO2 not divided   */
#define LL_RCC_MCO2_PRESCALER_2                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_1)                                               /*!< MCO2 divided by 2  */
#define LL_RCC_MCO2_PRESCALER_3                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_0 | RCC_CFGR1_MCO2PRE_1)                         /*!< MCO2 divided by 3  */
#define LL_RCC_MCO2_PRESCALER_4                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_2)                                               /*!< MCO2 divided by 4  */
#define LL_RCC_MCO2_PRESCALER_5                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_0)                         /*!< MCO2 divided by 5  */
#define LL_RCC_MCO2_PRESCALER_6                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_1)                         /*!< MCO2 divided by 6  */
#define LL_RCC_MCO2_PRESCALER_7                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_1 | RCC_CFGR1_MCO2PRE_0)   /*!< MCO2 divided by 7  */
#define LL_RCC_MCO2_PRESCALER_8                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_3)                                               /*!< MCO2 divided by 8  */
#define LL_RCC_MCO2_PRESCALER_9                    (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_3 | RCC_CFGR1_MCO2PRE_0)                         /*!< MCO2 divided by 9  */
#define LL_RCC_MCO2_PRESCALER_10                   (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_3 | RCC_CFGR1_MCO2PRE_1)                         /*!< MCO2 divided by 10 */
#define LL_RCC_MCO2_PRESCALER_11                   (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_3 | RCC_CFGR1_MCO2PRE_1 | RCC_CFGR1_MCO2PRE_0)   /*!< MCO2 divided by 11 */
#define LL_RCC_MCO2_PRESCALER_12                   (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_3 | RCC_CFGR1_MCO2PRE_2)                         /*!< MCO2 divided by 12 */
#define LL_RCC_MCO2_PRESCALER_13                   (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_3 | RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_0)   /*!< MCO2 divided by 13 */
#define LL_RCC_MCO2_PRESCALER_14                   (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE_3 | RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_1)   /*!< MCO2 divided by 14 */
#define LL_RCC_MCO2_PRESCALER_15                   (uint32_t)((RCC_CFGR1_MCO2PRE>>16U) | RCC_CFGR1_MCO2PRE)                                                 /*!< MCO2 divided by 15 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE            0U                     /*!< No clock used as RTC clock                               */
#define LL_RCC_RTC_CLKSOURCE_LSE             RCC_RTCCR_RTCSEL_0     /*!< LSE oscillator clock used as RTC clock                   */
#define LL_RCC_RTC_CLKSOURCE_LSI             RCC_RTCCR_RTCSEL_1     /*!< LSI oscillator clock used as RTC clock                   */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV         RCC_RTCCR_RTCSEL       /*!< HSE oscillator clock divided by RTCPRE used as RTC clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USARTx_CLKSOURCE  Peripheral USARTx clock source selection
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE_PCLK2        LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART1SEL_Pos, RCC_CCIPR1_USART1SEL, 0UL)                    /*!< PCLK2 clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_PSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART1SEL_Pos, RCC_CCIPR1_USART1SEL, RCC_CCIPR1_USART1SEL_0) /*!< PSIK clock used as USART1 clock source  */
#define LL_RCC_USART1_CLKSOURCE_HSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART1SEL_Pos, RCC_CCIPR1_USART1SEL, RCC_CCIPR1_USART1SEL_1) /*!< HSIK clock used as USART1 clock source  */
#define LL_RCC_USART1_CLKSOURCE_LSE          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART1SEL_Pos, RCC_CCIPR1_USART1SEL, RCC_CCIPR1_USART1SEL)   /*!< LSE clock used as USART1 clock source   */

