MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
#define LL_RCC_USART2_CLKSOURCE_PCLK1        LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART2SEL_Pos, RCC_CCIPR1_USART2SEL, 0UL)                    /*!< PCLK1 clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_PSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART2SEL_Pos, RCC_CCIPR1_USART2SEL, RCC_CCIPR1_USART2SEL_0) /*!< PSIK clock used as USART2 clock source  */
#define LL_RCC_USART2_CLKSOURCE_HSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART2SEL_Pos, RCC_CCIPR1_USART2SEL, RCC_CCIPR1_USART2SEL_1) /*!< HSIK clock used as USART2 clock source  */
#define LL_RCC_USART2_CLKSOURCE_LSE          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART2SEL_Pos, RCC_CCIPR1_USART2SEL, RCC_CCIPR1_USART2SEL)   /*!< LSE clock used as USART2 clock source   */

#if defined(USART3)
#define LL_RCC_USART3_CLKSOURCE_PCLK1        LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART3SEL_Pos, RCC_CCIPR1_USART3SEL, 0UL)                       /*!< PCLK1 clock used as USART3 clock source */
#define LL_RCC_USART3_CLKSOURCE_PSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART3SEL_Pos, RCC_CCIPR1_USART3SEL, RCC_CCIPR1_USART3SEL_0)    /*!< PSIK clock used as USART3 clock source  */
#define LL_RCC_USART3_CLKSOURCE_HSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART3SEL_Pos, RCC_CCIPR1_USART3SEL, RCC_CCIPR1_USART3SEL_1)    /*!< HSIK clock used as USART3 clock source  */
#define LL_RCC_USART3_CLKSOURCE_LSE          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART3SEL_Pos, RCC_CCIPR1_USART3SEL, RCC_CCIPR1_USART3SEL)      /*!< LSE clock used as USART3 clock source   */

#endif /* USART3 */
#if defined(USART6)
#define LL_RCC_USART6_CLKSOURCE_PCLK1        LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART6SEL_Pos, RCC_CCIPR1_USART6SEL, 0UL)                       /*!< PCLK1 clock used as USART6 clock source */
#define LL_RCC_USART6_CLKSOURCE_PSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART6SEL_Pos, RCC_CCIPR1_USART6SEL, RCC_CCIPR1_USART6SEL_0)    /*!< PSIK clock used as USART6 clock source  */
#define LL_RCC_USART6_CLKSOURCE_HSIK         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART6SEL_Pos, RCC_CCIPR1_USART6SEL, RCC_CCIPR1_USART6SEL_1)    /*!< HSIK clock used as USART6 clock source  */
#define LL_RCC_USART6_CLKSOURCE_LSE          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART6SEL_Pos, RCC_CCIPR1_USART6SEL, RCC_CCIPR1_USART6SEL)      /*!< LSE clock used as USART6 clock source   */

#endif /* USART6 */
/**
  * @}
  */ /* End of RCC_LL_EC_USART_CLKSOURCE */

/** @defgroup RCC_LL_EC_UARTx_CLKSOURCE  Peripheral UARTx clock source selection
  * @{
  */
#define LL_RCC_UART4_CLKSOURCE_PCLK1         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART4SEL_Pos, RCC_CCIPR1_UART4SEL, 0UL)                       /*!< PCLK1 clock used as UART4 clock source */
#define LL_RCC_UART4_CLKSOURCE_PSIK          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART4SEL_Pos, RCC_CCIPR1_UART4SEL, RCC_CCIPR1_UART4SEL_0)     /*!< PSIK clock used as UART4 clock source  */
#define LL_RCC_UART4_CLKSOURCE_HSIK          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART4SEL_Pos, RCC_CCIPR1_UART4SEL, RCC_CCIPR1_UART4SEL_1)     /*!< HSIK clock used as UART4 clock source  */
#define LL_RCC_UART4_CLKSOURCE_LSE           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART4SEL_Pos, RCC_CCIPR1_UART4SEL, RCC_CCIPR1_UART4SEL)       /*!< LSE clock used as UART4 clock source   */

#define LL_RCC_UART5_CLKSOURCE_PCLK1         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART5SEL_Pos, RCC_CCIPR1_UART5SEL, 0UL)                       /*!< PCLK1 clock used as UART5 clock source */
#define LL_RCC_UART5_CLKSOURCE_PSIK          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART5SEL_Pos, RCC_CCIPR1_UART5SEL, RCC_CCIPR1_UART5SEL_0)     /*!< PSIK clock used as UART5 clock source  */
#define LL_RCC_UART5_CLKSOURCE_HSIK          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART5SEL_Pos, RCC_CCIPR1_UART5SEL, RCC_CCIPR1_UART5SEL_1)     /*!< HSIK clock used as UART5 clock source  */
#define LL_RCC_UART5_CLKSOURCE_LSE           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART5SEL_Pos, RCC_CCIPR1_UART5SEL, RCC_CCIPR1_UART5SEL)       /*!< LSE clock used as UART5 clock source   */
#if defined(UART7)
#define LL_RCC_UART7_CLKSOURCE_PCLK1         LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART7SEL_Pos, RCC_CCIPR1_UART7SEL, 0UL)                       /*!< PCLK1 clock used as UART7 clock source */
#define LL_RCC_UART7_CLKSOURCE_PSIK          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART7SEL_Pos, RCC_CCIPR1_UART7SEL, RCC_CCIPR1_UART7SEL_0)     /*!< PSIK clock used as UART7 clock source  */
#define LL_RCC_UART7_CLKSOURCE_HSIK          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART7SEL_Pos, RCC_CCIPR1_UART7SEL, RCC_CCIPR1_UART7SEL_1)     /*!< HSIK clock used as UART7 clock source  */
#define LL_RCC_UART7_CLKSOURCE_LSE           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART7SEL_Pos, RCC_CCIPR1_UART7SEL, RCC_CCIPR1_UART7SEL)       /*!< LSE clock used as UART7 clock source   */

#endif /* UART7 */
/**
  * @}
  */ /* End of RCC_LL_EC_UART_CLKSOURCE */

/** @defgroup RCC_LL_EC_LPUART_CLKSOURCE  Peripheral LPUART clock source selection
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE_PCLK3       0U                      /*!< PCLK3 clock used as LPUART1 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_HSIK        RCC_CCIPR1_LPUART1SEL_0 /*!< HSIK clock used as LPUART1 clock source  */
#define LL_RCC_LPUART1_CLKSOURCE_LSE         RCC_CCIPR1_LPUART1SEL_1 /*!< LSE clock used as LPUART1 clock source   */
#define LL_RCC_LPUART1_CLKSOURCE_LSI         RCC_CCIPR1_LPUART1SEL   /*!< LSI clock used as LPUART1 clock source   */
/**
  * @}
  */ /* End of RCC_LL_EC_LPUART_CLKSOURCE */

/** @defgroup RCC_LL_EC_SPIx_CLKSOURCE  Peripheral SPIx clock source selection
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE_PCLK2          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI1SEL_Pos, RCC_CCIPR1_SPI1SEL, 0UL)                   /*!< PCLK2 clock used as SPI1 clock source    */
#define LL_RCC_SPI1_CLKSOURCE_PSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI1SEL_Pos, RCC_CCIPR1_SPI1SEL, RCC_CCIPR1_SPI1SEL_0)  /*!< PSIK clock used as SPI1 clock source     */
#define LL_RCC_SPI1_CLKSOURCE_HSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI1SEL_Pos, RCC_CCIPR1_SPI1SEL, RCC_CCIPR1_SPI1SEL_1)  /*!< HSIK clock used as SPI1 clock source     */
#define LL_RCC_SPI1_CLKSOURCE_AUDIOCLK       LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI1SEL_Pos, RCC_CCIPR1_SPI1SEL, RCC_CCIPR1_SPI1SEL)    /*!< AUDIOCLK clock used as SPI1 clock source */

#define LL_RCC_SPI2_CLKSOURCE_PCLK1          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI2SEL_Pos, RCC_CCIPR1_SPI2SEL, 0UL)                   /*!< PCLK1 clock used as SPI2 clock source    */
#define LL_RCC_SPI2_CLKSOURCE_PSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI2SEL_Pos, RCC_CCIPR1_SPI2SEL, RCC_CCIPR1_SPI2SEL_0)  /*!< PSIK clock used as SPI2 clock source     */
#define LL_RCC_SPI2_CLKSOURCE_HSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI2SEL_Pos, RCC_CCIPR1_SPI2SEL, RCC_CCIPR1_SPI2SEL_1)  /*!< HSIK clock used as SPI2 clock source     */
#define LL_RCC_SPI2_CLKSOURCE_AUDIOCLK       LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI2SEL_Pos, RCC_CCIPR1_SPI2SEL, RCC_CCIPR1_SPI2SEL)    /*!< AUDIOCLK clock used as SPI2 clock source */
#if defined(SPI3)
#define LL_RCC_SPI3_CLKSOURCE_PCLK1          LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI3SEL_Pos, RCC_CCIPR1_SPI3SEL, 0UL)                   /*!< PCLK1 clock used as SPI3 clock source    */
#define LL_RCC_SPI3_CLKSOURCE_PSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI3SEL_Pos, RCC_CCIPR1_SPI3SEL, RCC_CCIPR1_SPI3SEL_0)  /*!< PSIK clock used as SPI3 clock source     */
#define LL_RCC_SPI3_CLKSOURCE_HSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI3SEL_Pos, RCC_CCIPR1_SPI3SEL, RCC_CCIPR1_SPI3SEL_1)  /*!< HSIK clock used as SPI3 clock source     */
#define LL_RCC_SPI3_CLKSOURCE_AUDIOCLK       LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI3SEL_Pos, RCC_CCIPR1_SPI3SEL, RCC_CCIPR1_SPI3SEL)    /*!< AUDIOCLK clock used as SPI3 clock source */

#endif /* SPI3 */
/**
  * @}
  */ /* End of RCC_LL_EC_SPI_CLKSOURCE */

#if defined(FDCAN1)
/** @defgroup RCC_LL_EC_FDCAN_CLKSOURCE  Peripheral FDCAN clock source selection
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE_PCLK1        0U                     /*!< PCLK1 clock used as FDCAN clock source */
#define LL_RCC_FDCAN_CLKSOURCE_PSIS         RCC_CCIPR1_FDCANSEL_0  /*!< PSIS clock used as FDCAN clock source  */
#define LL_RCC_FDCAN_CLKSOURCE_PSIK         RCC_CCIPR1_FDCANSEL_1  /*!< PSIK clock used as FDCAN clock source  */
#define LL_RCC_FDCAN_CLKSOURCE_HSE          RCC_CCIPR1_FDCANSEL    /*!< HSE clock used as FDCAN clock source   */
/**
  * @}
  */ /* End of RCC_LL_EC_FDCAN_CLKSOURCE */

#endif /* FDCAN1 */
/** @defgroup RCC_LL_EC_I2Cx_CLKSOURCE  Peripheral I2Cx clock source selection
  * @{
  */
#define LL_RCC_I2C1_CLKSOURCE_PCLK1          LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C1SEL_Pos, RCC_CCIPR2_I2C1SEL, 0UL)                  /*!< PCLK1 clock used as I2C1 clock source */
#define LL_RCC_I2C1_CLKSOURCE_PSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C1SEL_Pos, RCC_CCIPR2_I2C1SEL, RCC_CCIPR2_I2C1SEL_0) /*!< PSIK clock used as I2C1 clock source  */
#define LL_RCC_I2C1_CLKSOURCE_HSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C1SEL_Pos, RCC_CCIPR2_I2C1SEL, RCC_CCIPR2_I2C1SEL_1) /*!< HSIK clock used as I2C1 clock source  */
#if defined(I2C2)
#define LL_RCC_I2C2_CLKSOURCE_PCLK1          LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C2SEL_Pos, RCC_CCIPR2_I2C2SEL, 0UL)                   /*!< PCLK1 clock used as I2C2 clock source */
#define LL_RCC_I2C2_CLKSOURCE_PSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C2SEL_Pos, RCC_CCIPR2_I2C2SEL,  RCC_CCIPR2_I2C2SEL_0) /*!< PSIK clock used as I2C2 clock source  */
#define LL_RCC_I2C2_CLKSOURCE_HSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C2SEL_Pos, RCC_CCIPR2_I2C2SEL,  RCC_CCIPR2_I2C2SEL_1) /*!< HSIK clock used as I2C2 clock source  */

#endif /* I2C2 */
/**
  * @}
  */ /* End of RCC_LL_EC_I2C_CLKSOURCE */

/** @defgroup RCC_LL_EC_I3C_CLKSOURCE  Peripheral I3C clock source selection
  * @{
  */
#define LL_RCC_I3C1_CLKSOURCE_PCLK1          0U                   /*!< PCLK1 clock used as I3C1 clock source */
#define LL_RCC_I3C1_CLKSOURCE_PSIK           RCC_CCIPR2_I3C1SEL_0 /*!< PSIK clock used as I3C1 clock source  */
#define LL_RCC_I3C1_CLKSOURCE_HSIK           RCC_CCIPR2_I3C1SEL_1 /*!< HSIK clock used as I3C1 clock source  */
/**
  * @}
  */ /* End of RCC_LL_EC_I3C_CLKSOURCE */

/** @defgroup RCC_LL_EC_ADCDAC_CLKSOURCE  Peripheral ADCDAC clock source selection
  * @{
  */
#define LL_RCC_ADCDAC_CLKSOURCE_HCLK         0U                     /*!< HCLK clock used as ADCDAC clock source */
#define LL_RCC_ADCDAC_CLKSOURCE_PSIS         RCC_CCIPR2_ADCDACSEL_0 /*!< PSIS clock used as ADCDAC clock source */
#define LL_RCC_ADCDAC_CLKSOURCE_PSIK         RCC_CCIPR2_ADCDACSEL_1 /*!< PSIK clock used as ADCDAC clock source */
#define LL_RCC_ADCDAC_CLKSOURCE_HSIK         RCC_CCIPR2_ADCDACSEL   /*!< HSIK clock used as ADCDAC clock source */
/**
  * @}
  */ /* End of RCC_LL_EC_ADCDAC_CLKSOURCE */

#if defined(RCC_CR1_HSIDIV3ON)
/** @defgroup RCC_LL_EC_ADCDAC_PRESCALER  ADCDAC prescaler
  * @{
  */
#define LL_RCC_ADCDAC_PRESCALER_1               0U                                                                              /*!< ADC and DAC kernel clock not divided    */
#define LL_RCC_ADCDAC_PRESCALER_2               RCC_CCIPR2_ADCDACPRE_0                                                          /*!< ADC and DAC kernel clock divided by 2   */
#define LL_RCC_ADCDAC_PRESCALER_4               RCC_CCIPR2_ADCDACPRE_1                                                          /*!< ADC and DAC kernel clock divided by 4   */
#define LL_RCC_ADCDAC_PRESCALER_8               (RCC_CCIPR2_ADCDACPRE_1 | RCC_CCIPR2_ADCDACPRE_0)                               /*!< ADC and DAC kernel clock divided by 8   */
#define LL_RCC_ADCDAC_PRESCALER_16              (RCC_CCIPR2_ADCDACPRE_2)                                                        /*!< ADC and DAC kernel clock divided by 16  */
#define LL_RCC_ADCDAC_PRESCALER_32              (RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_0)                               /*!< ADC and DAC kernel clock divided by 32  */
#define LL_RCC_ADCDAC_PRESCALER_64              (RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_1)                               /*!< ADC and DAC kernel clock divided by 64  */
#define LL_RCC_ADCDAC_PRESCALER_128             (RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_1 | RCC_CCIPR2_ADCDACPRE_0)      /*!< ADC and DAC kernel clock divided by 128 */

#endif /* RCC_CR1_HSIDIV3ON */
/**
  * @}
  */ /* End of RCC_LL_EC_ADCDAC_PRESCALER */

/** @defgroup RCC_LL_EC_DAC1SH_CLKSOURCE  DAC1 Sample and hold clock source selection
  * @{
  */
#define LL_RCC_DAC1SH_CLKSOURCE_LSE           0U                     /*!< LSE clock used as DAC1 clock source */
#define LL_RCC_DAC1SH_CLKSOURCE_LSI           RCC_CCIPR2_DACSEL      /*!< LSI clock used as DAC1 clock source */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPTIM_CLKSOURCE  Peripheral LPTIM clock source selection
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE_PCLK3        0U                     /*!< PCLK3 clock used as LPTIM1 clock source */
#define LL_RCC_LPTIM1_CLKSOURCE_HSIK         RCC_CCIPR2_LPTIM1SEL_0 /*!< HSIK clock used as LPTIM1 clock source  */
#define LL_RCC_LPTIM1_CLKSOURCE_LSE          RCC_CCIPR2_LPTIM1SEL_1 /*!< LSE clock used as LPTIM1 clock source   */
#define LL_RCC_LPTIM1_CLKSOURCE_LSI          RCC_CCIPR2_LPTIM1SEL   /*!< LSI clock used as LPTIM1 clock source   */
/**
  * @}
  */ /* End of RCC_LL_EC_LPTIM_CLKSOURCE */

/** @defgroup RCC_LL_EC_CK_CLKSOURCE  Peripheral USBFS (48MHz) clock source selection
  * @{
  */
#define LL_RCC_CK48_NONE                     0U                     /*!< CK48 clock source disable                 */
#define LL_RCC_CK48_CLKSOURCE_PSIDIV3       RCC_CCIPR2_CK48SEL_0    /*!< PSI_DIV_3 clock used as CK48 clock source */
#define LL_RCC_CK48_CLKSOURCE_HSIDIV3       RCC_CCIPR2_CK48SEL_1    /*!< HSI_DIV_3 clock used as CK48 clock source */
#define LL_RCC_CK48_CLKSOURCE_HSE            RCC_CCIPR2_CK48SEL     /*!< HSE clock used as CK48 clock source       */
/**
  * @}
  */ /* End of RCC_LL_EC_CK_CLKSOURCE */
#if defined(XSPI1)
/** @defgroup RCC_LL_EC_XSPI_CLKSOURCE  Peripheral XSPI clock source selection
  * @{
  */
#define LL_RCC_XSPI1_CLKSOURCE_HCLK        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_XSPI1SEL_Pos, RCC_CCIPR3_XSPI1SEL, 0UL)                       /*!< HCLK clock used as XSPI1 clock source */
#define LL_RCC_XSPI1_CLKSOURCE_PSIK        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_XSPI1SEL_Pos, RCC_CCIPR3_XSPI1SEL, RCC_CCIPR3_XSPI1SEL_0)     /*!< PSIK clock used as XSPI1 clock source */
#define LL_RCC_XSPI1_CLKSOURCE_HSIK        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_XSPI1SEL_Pos, RCC_CCIPR3_XSPI1SEL, RCC_CCIPR3_XSPI1SEL_1)     /*!< HSIK clock used as XSPI1 clock source */

/**
  * @}
  */ /* End of RCC_LL_EC_XSPI_CLKSOURCE */
#endif /* XSPI1*/

