MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
#if defined(ETH1)
/** @defgroup RCC_LL_EC_ETH1_CLKSOURCE  Peripheral ETH1 clock source selection
  * @{
  */
#define LL_RCC_ETH1REF_CLKSOURCE_RMII        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1REFCLKSEL_Pos, RCC_CCIPR3_ETH1REFCLKSEL, 0UL)                         /*!< PHY clock used as ETH1 REF clock source      */
#define LL_RCC_ETH1REF_CLKSOURCE_FB          LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1REFCLKSEL_Pos, RCC_CCIPR3_ETH1REFCLKSEL, RCC_CCIPR3_ETH1REFCLKSEL)     /*!< Feedback clock used as ETH1 REF clock source */

#define LL_RCC_ETH1PTP_CLKSOURCE_NONE        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1PTPCLKSEL_Pos, RCC_CCIPR3_ETH1PTPCLKSEL, 0UL)                         /*!< ETH1 PTP clock source disable            */
#define LL_RCC_ETH1PTP_CLKSOURCE_HCLK        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1PTPCLKSEL_Pos, RCC_CCIPR3_ETH1PTPCLKSEL, RCC_CCIPR3_ETH1PTPCLKSEL_0)   /*!< HCLK clock used as ETH1 PTP clock source */
#define LL_RCC_ETH1PTP_CLKSOURCE_PSIS        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1PTPCLKSEL_Pos, RCC_CCIPR3_ETH1PTPCLKSEL, RCC_CCIPR3_ETH1PTPCLKSEL_1)   /*!< PSIS clock used as ETH1 PTP clock source */
#define LL_RCC_ETH1PTP_CLKSOURCE_PSIK        LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1PTPCLKSEL_Pos, RCC_CCIPR3_ETH1PTPCLKSEL, RCC_CCIPR3_ETH1PTPCLKSEL)     /*!< PSIK clock used as ETH1 PTP clock source */

#define LL_RCC_ETH1_CLKSOURCE_NONE           LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1CLKSEL_Pos, RCC_CCIPR3_ETH1CLKSEL, 0UL)                               /*!< ETH1 clock source disable            */
#define LL_RCC_ETH1_CLKSOURCE_PSIS           LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1CLKSEL_Pos, RCC_CCIPR3_ETH1CLKSEL, RCC_CCIPR3_ETH1CLKSEL_0)            /*!< PSIS clock used as ETH1 clock source */
#define LL_RCC_ETH1_CLKSOURCE_PSIK           LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1CLKSEL_Pos, RCC_CCIPR3_ETH1CLKSEL, RCC_CCIPR3_ETH1CLKSEL_1)            /*!< PSIK clock used as ETH1 clock source */
#define LL_RCC_ETH1_CLKSOURCE_HSE            LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1CLKSEL_Pos, RCC_CCIPR3_ETH1CLKSEL, RCC_CCIPR3_ETH1CLKSEL)              /*!< HSE clock used as ETH1 clock source  */
/**
  * @}
  */ /* End of RCC_LL_EC_ETH1_CLKSOURCE */

/** @defgroup RCC_LL_EC_ETH1_PRESCALER  ETH1 prescaler
  * @{
  */
#define LL_RCC_ETH1_PRESCALER_1               0U                                  /*!< ETH1 clock not divided  */
#define LL_RCC_ETH1_PRESCALER_2               RCC_CCIPR3_ETH1CLKDIV_0             /*!< ETH1 clock divided by 2 */
#define LL_RCC_ETH1_PRESCALER_4               RCC_CCIPR3_ETH1CLKDIV_1             /*!< ETH1 clock divided by 4 */
/**
  * @}
  */ /* End of RCC_LL_EC_ETH1_PRESCALER */

#endif /* ETH1 */
/** @defgroup RCC_LL_EC_USARTx  Peripheral USARTx get clock source
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE              LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART1SEL_Pos, RCC_CCIPR1_USART1SEL, 0UL) /*!< USART1 Clock source selection */
#define LL_RCC_USART2_CLKSOURCE              LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART2SEL_Pos, RCC_CCIPR1_USART2SEL, 0UL) /*!< USART2 Clock source selection */
#if defined(USART3)
#define LL_RCC_USART3_CLKSOURCE              LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART3SEL_Pos, RCC_CCIPR1_USART3SEL, 0UL) /*!< USART3 Clock source selection */
#endif /* USART3 */
#if defined(USART6)
#define LL_RCC_USART6_CLKSOURCE              LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_USART6SEL_Pos, RCC_CCIPR1_USART6SEL, 0UL) /*!< USART6 Clock source selection */
#endif /* USART6 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_UARTx  Peripheral UARTx get clock source
  * @{
  */
#define LL_RCC_UART4_CLKSOURCE               LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART4SEL_Pos, RCC_CCIPR1_UART4SEL, 0UL) /*!< UART4 Clock source selection */
#define LL_RCC_UART5_CLKSOURCE               LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART5SEL_Pos, RCC_CCIPR1_UART5SEL, 0UL) /*!< UART5 Clock source selection */
#if defined(UART7)
#define LL_RCC_UART7_CLKSOURCE               LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_UART7SEL_Pos, RCC_CCIPR1_UART7SEL, 0UL) /*!< UART7 Clock source selection */
#endif /* UART7 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPUART  Peripheral LPUART get clock source
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE             RCC_CCIPR1_LPUART1SEL /*!< LPUART1 Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SPIx  Peripheral SPIx get clock source
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI1SEL_Pos, RCC_CCIPR1_SPI1SEL, 0UL) /*!< SPI1 Clock source selection */
#define LL_RCC_SPI2_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI2SEL_Pos, RCC_CCIPR1_SPI2SEL, 0UL) /*!< SPI2 Clock source selection */
#if defined(SPI3)
#define LL_RCC_SPI3_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR1, (uint32_t)RCC_CCIPR1_SPI3SEL_Pos, RCC_CCIPR1_SPI3SEL, 0UL) /*!< SPI3 Clock source selection */
#endif /* SPI3 */
/**
  * @}
  */
#if defined(FDCAN1)

/** @defgroup RCC_LL_EC_FDCAN  Peripheral FDCAN get clock source
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE              RCC_CCIPR1_FDCANSEL /*!< FDCAN Clock source selection */
/**
  * @}
  */

#endif /* FDCAN1 */
/** @defgroup RCC_LL_EC_I2Cx  Peripheral I2Cx get clock source
  * @{
  */
#define LL_RCC_I2C1_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C1SEL_Pos, RCC_CCIPR2_I2C1SEL, 0UL) /*!< I2C1 Clock source selection */
#if defined(I2C2)
#define LL_RCC_I2C2_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR2, (uint32_t)RCC_CCIPR2_I2C2SEL_Pos, RCC_CCIPR2_I2C2SEL, 0UL) /*!< I2C2 Clock source selection */
#endif /* I2C2 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_I3C  Peripheral I3C get clock source
  * @{
  */
#define LL_RCC_I3C1_CLKSOURCE                RCC_CCIPR2_I3C1SEL /*!< I3C1 Clock source selection */
/**
  * @}
  */

