MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/** @defgroup RCC_LL_EC_ADCDAC  Peripheral ADCDAC get clock source
  * @{
  */
#define LL_RCC_ADCDAC_CLKSOURCE              RCC_CCIPR2_ADCDACSEL /*!< ADCDAC Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_DAC1  Peripheral DAC1SH get clock source
  * @{
  */
#define LL_RCC_DAC1SH_CLKSOURCE                 RCC_CCIPR2_DACSEL /*!< DAC1SH Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPTIM  Peripheral LPTIM get clock source
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE              RCC_CCIPR2_LPTIM1SEL /*!< LPTIM1 Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_CK  Peripheral USBFS (48MHz) get clock source
  * @{
  */
#define LL_RCC_CK48_CLKSOURCE                RCC_CCIPR2_CK48SEL /*!< CK48 Clock source selection */
/**
  * @}
  */
#if defined(XSPI1)
/** @defgroup RCC_LL_EC_XSPI  Peripheral XSPI1 get clock source
  * @{
  */
#define LL_RCC_XSPI1_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_XSPI1SEL_Pos, RCC_CCIPR3_XSPI1SEL, 0UL) /*!< XSPI1 Clock source selection */
/**
  * @}
  */

#endif /* XSPI1 */
#if defined(ETH1)
/** @defgroup RCC_LL_EC_ETH1  Peripheral ETH1 get clock source
  * @{
  */
#define LL_RCC_ETH1REF_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1REFCLKSEL_Pos, RCC_CCIPR3_ETH1REFCLKSEL, 0UL) /*!< ETH1REF Clock source selection */
#define LL_RCC_ETH1PTP_CLKSOURCE                LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1PTPCLKSEL_Pos, RCC_CCIPR3_ETH1PTPCLKSEL, 0UL) /*!< ETH1PTP Clock source selection */
#define LL_RCC_ETH1_CLKSOURCE                   LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1CLKSEL_Pos, RCC_CCIPR3_ETH1CLKSEL, 0UL)       /*!< ETH1 Clock source selection    */
/**
  * @}
  */

#endif /* ETH1 */
/** @defgroup RCC_LL_FLAGS RCC Flags
  * @{
  */
#define LL_RCC_IT_LSIRDY     RCC_CIFR_LSIRDYF      /*!< LSI ready interrupt flag     */
#define LL_RCC_IT_LSERDY     RCC_CIFR_LSERDYF      /*!< LSE ready interrupt flag     */
#define LL_RCC_IT_HSIRDY     RCC_CIFR_HSISRDYF     /*!< HSIS ready interrupt flag    */
#define LL_RCC_IT_HSIDIV3RDY RCC_CIFR_HSIDIV3RDYF  /*!< HSIDIV3 ready interrupt flag */
#define LL_RCC_IT_PSIDIV3RDY RCC_CIFR_PSIDIV3RDYF  /*!< PSIDIV3 ready interrupt flag */
#define LL_RCC_IT_HSIKRDY    RCC_CIFR_HSIKRDYF     /*!< HSIK ready interrupt flag    */
#define LL_RCC_IT_PSIRDY     RCC_CIFR_PSISRDYF     /*!< PSIS ready interrupt flag    */
#define LL_RCC_IT_PSIKRDY    RCC_CIFR_PSIKRDYF     /*!< PSIK ready interrupt flag    */
#define LL_RCC_IT_HSERDY     RCC_CIFR_HSERDYF      /*!< HSE ready interrupt flag     */
#define LL_RCC_IT_HSECSS     RCC_CIFR_HSECSSF      /*!< HSE clock security system interrupt flag */
#define LL_RCC_IT_LSECSS     RCC_CIFR_LSECSSF      /*!< LSE clock security system interrupt flag */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ATTRIBUTES RCC Secure/Privilege/Lock/Public attributes
  * @{
  */
#define LL_RCC_ATTR_NPRIV                   0UL                  /*!< Non-privileged attribute        */
#define LL_RCC_ATTR_PRIV                    1UL                  /*!< Privileged attribute            */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PRIV_ITEMS RCC Privilege Attribute Items
  * @{
  */
#define LL_RCC_PRIV_ITEM_ALL                RCC_PRIVCFGR_PRIV
/**
  * @}
  */

/**
  * @}
  */ /* End of RCC_LL_Exported_Constants */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Macros LL RCC Macros
  * @{
  */

/** @defgroup RCC_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RCC register.
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_RCC_WRITE_REG(reg, value) STM32_WRITE_REG(RCC->reg, (value))

/**
  * @brief  Read a value in RCC register.
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_RCC_READ_REG(reg) STM32_READ_REG(RCC->reg)
/**
  * @}
  */ /* End of RCC_LL_EM_WRITE_READ */

/** @defgroup RCC_LL_EM_CALC_FREQ Calculate frequencies
  * @{
  */

/**
  * @brief  Helper macro to calculate the HCLK frequency.
  * @param  sysclk_freq SYSCLK frequency (based on HSIS/HSIDIV3/HSE/PSIS)
  * @param  ahb_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HCLK_PRESCALER_1
  *         @arg @ref LL_RCC_HCLK_PRESCALER_2
  *         @arg @ref LL_RCC_HCLK_PRESCALER_4
  *         @arg @ref LL_RCC_HCLK_PRESCALER_8
  *         @arg @ref LL_RCC_HCLK_PRESCALER_16
  *         @arg @ref LL_RCC_HCLK_PRESCALER_64
  *         @arg @ref LL_RCC_HCLK_PRESCALER_128
  *         @arg @ref LL_RCC_HCLK_PRESCALER_256
  *         @arg @ref LL_RCC_HCLK_PRESCALER_512
  * @retval HCLK clock frequency (in Hz)
  */
#define LL_RCC_CALC_HCLK_FREQ(sysclk_freq, ahb_prescaler) ((sysclk_freq) >> \
                                                           AHBPrescTable[((ahb_prescaler)& RCC_CFGR2_HPRE) \
                                                                         >>  RCC_CFGR2_HPRE_Pos])

/**
  * @brief  Helper macro to calculate the PCLK1 frequency (ABP1).
  * @param  hclk_freq HCLK frequency
  * @param  apb1_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_PRESCALER_1
  *         @arg @ref LL_RCC_APB1_PRESCALER_2
  *         @arg @ref LL_RCC_APB1_PRESCALER_4
  *         @arg @ref LL_RCC_APB1_PRESCALER_8
  *         @arg @ref LL_RCC_APB1_PRESCALER_16
  * @retval PCLK1 clock frequency (in Hz)
  */
#define LL_RCC_CALC_PCLK1_FREQ(hclk_freq, apb1_prescaler) ((hclk_freq) >> \
                                                           (APBPrescTable[((apb1_prescaler)& \
                                                                           RCC_CFGR2_PPRE1) >>  RCC_CFGR2_PPRE1_Pos]))

/**
  * @brief  Helper macro to calculate the PCLK2 frequency (ABP2).
  * @param  hclk_freq HCLK frequency
  * @param  apb2_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_PRESCALER_1
  *         @arg @ref LL_RCC_APB2_PRESCALER_2
  *         @arg @ref LL_RCC_APB2_PRESCALER_4
  *         @arg @ref LL_RCC_APB2_PRESCALER_8
  *         @arg @ref LL_RCC_APB2_PRESCALER_16
  * @retval PCLK2 clock frequency (in Hz)
  */
#define LL_RCC_CALC_PCLK2_FREQ(hclk_freq, apb2_prescaler) ((hclk_freq) >> \
                                                           (APBPrescTable[((apb2_prescaler)& \
                                                                           RCC_CFGR2_PPRE2) >>  RCC_CFGR2_PPRE2_Pos]))

/**
  * @brief  Helper macro to calculate the PCLK3 frequency (ABP3).
  * @param  hclk_freq HCLK frequency
  * @param  apb3_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB3_PRESCALER_1
  *         @arg @ref LL_RCC_APB3_PRESCALER_2
  *         @arg @ref LL_RCC_APB3_PRESCALER_4
  *         @arg @ref LL_RCC_APB3_PRESCALER_8
  *         @arg @ref LL_RCC_APB3_PRESCALER_16
  * @retval PCLK3 clock frequency (in Hz)
  */
#define LL_RCC_CALC_PCLK3_FREQ(hclk_freq, apb3_prescaler) ((hclk_freq) >> \
                                                           (APBPrescTable[((apb3_prescaler)& \
                                                                           RCC_CFGR2_PPRE3) >>  RCC_CFGR2_PPRE3_Pos]))

/**
  * @}
  */ /* End of RCC_LL_EM_CALC_FREQ */

/**
  * @}
  */ /* End of RCC_LL_Exported_Macros */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Functions LL RCC Functions
  * @{
  */

/** @defgroup RCC_LL_EF_LSI LSI
  * @{
  */

/**
  * @brief  Enable LSI oscillator (LSI ON).
  * @rmtoll
  *  RTCCR         LSION        LL_RCC_LSI_Enable
  */
__STATIC_INLINE void LL_RCC_LSI_Enable(void)
{
  STM32_SET_BIT(RCC->RTCCR, RCC_RTCCR_LSION);
}

/**
  * @brief  Disable LSI oscillator (LSI ON).
  * @rmtoll
  *  RTCCR         LSION        LL_RCC_LSI_Disable
  */
__STATIC_INLINE void LL_RCC_LSI_Disable(void)
{
  STM32_CLEAR_BIT(RCC->RTCCR, RCC_RTCCR_LSION);
}

/**
  * @brief  Check if LSI oscillator is ready.
  * @rmtoll
  *  RTCCR         LSIRDY         LL_RCC_LSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSIRDY) == RCC_RTCCR_LSIRDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI oscillator is enabled.
  * @rmtoll
  *  RTCCR         LSION         LL_RCC_LSI_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSION) == RCC_RTCCR_LSION) ? 1UL : 0UL);
}

/**
  * @}
  */ /* End of RCC_LL_EF_LSI */

/** @defgroup RCC_LL_EF_LSE LSE
  * @{
  */

/**
  * @brief  Enable LSE oscillatord (LSE ON).
  * @rmtoll
  *  RTCCR         LSEON        LL_RCC_LSE_Enable
  */
__STATIC_INLINE void LL_RCC_LSE_Enable(void)
{
  STM32_SET_BIT(RCC->RTCCR, RCC_RTCCR_LSEON);
}

/**
  * @brief  Disable LSE oscillatord (LSE ON).
  * @rmtoll
  *  RTCCR         LSEON        LL_RCC_LSE_Disable
  */
__STATIC_INLINE void LL_RCC_LSE_Disable(void)
{
  STM32_CLEAR_BIT(RCC->RTCCR, RCC_RTCCR_LSEON);
}

/**
  * @brief  Check if LSE oscillator is ready.
  * @rmtoll
  *  RTCCR         LSERDY         LL_RCC_LSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSERDY) == RCC_RTCCR_LSERDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE oscillator is enabled.
  * @rmtoll
  *  RTCCR         LSEON         LL_RCC_LSE_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSEON) == RCC_RTCCR_LSEON) ? 1UL : 0UL);
}

/**
  * @brief  Enable external clock source (LSE bypass).
  * @rmtoll
  *  RTCCR         LSEBYP        LL_RCC_LSE_EnableBypass
  */
__STATIC_INLINE void LL_RCC_LSE_EnableBypass(void)
{
  STM32_SET_BIT(RCC->RTCCR, RCC_RTCCR_LSEBYP);
}

/**
  * @brief  Configure LSE external oscillator in bypass.
  * @rmtoll
  *  RTCCR         LSEBYP        LL_RCC_LSE_ConfigBypass \n
  *  RTCCR         LSEEXT        LL_RCC_LSE_ConfigBypass
  * @param  lse_mode This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSE_ANALOG_MODE
  *         @arg @ref LL_RCC_LSE_DIGITAL_MODE
  */
__STATIC_INLINE void LL_RCC_LSE_ConfigBypass(uint32_t lse_mode)
{
  STM32_MODIFY_REG(RCC->RTCCR, RCC_RTCCR_LSEBYP | RCC_RTCCR_LSEEXT, RCC_RTCCR_LSEBYP | lse_mode);
}

/**
  * @brief  Disable external clock source (LSE bypass).
  * @rmtoll
  *  RTCCR         LSEBYP        LL_RCC_LSE_DisableBypass
  */
__STATIC_INLINE void LL_RCC_LSE_DisableBypass(void)
{
  STM32_CLEAR_BIT(RCC->RTCCR, RCC_RTCCR_LSEBYP);
}

/**
  * @brief  Check if LSE oscillator is bypassed.
  * @rmtoll
  *  RTCCR         LSEBYP        LL_RCC_LSE_IsBypassed
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsBypassed(void)
{
  return ((STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSEBYP) == RCC_RTCCR_LSEBYP) ? 1UL : 0UL);
}

/**
  * @brief  Set external LSE clock mode.
  * @rmtoll
  *  RTCCR         LSEEXT        LL_RCC_LSE_SetClockMode
  * @param  lse_mode This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSE_ANALOG_MODE
  *         @arg @ref LL_RCC_LSE_DIGITAL_MODE
  * @note This bit can be written only if the LSE oscillator is disabled.
  */
__STATIC_INLINE void LL_RCC_LSE_SetClockMode(uint32_t lse_mode)
{
  STM32_MODIFY_REG(RCC->RTCCR, RCC_RTCCR_LSEEXT, lse_mode);
}

/**
  * @brief  Get External LSE clock mode.
  * @rmtoll
  *  RTCCR         LSEEXT        LL_RCC_LSE_GetClockMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSE_ANALOG_MODE
  *         @arg @ref LL_RCC_LSE_DIGITAL_MODE
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_GetClockMode(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSEEXT));
}

/**
  * @brief  Set LSE oscillator drive capability.
  * @rmtoll
  *  RTCCR         LSEDRV        LL_RCC_LSE_SetDriveCapability
  * @param  lse_drive This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  * @note The oscillator is in Xtal mode when it is not in bypass mode.
  */
__STATIC_INLINE void LL_RCC_LSE_SetDriveCapability(uint32_t lse_drive)
{
  STM32_MODIFY_REG(RCC->RTCCR, RCC_RTCCR_LSEDRV, lse_drive);
}

/**
  * @brief  Get LSE oscillator drive capability.
  * @rmtoll
  *  RTCCR         LSEDRV        LL_RCC_LSE_GetDriveCapability
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_GetDriveCapability(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSEDRV));
}

/**
  * @brief  Enable LSE clock security system (LSE CSSON).
  * @rmtoll
  *  RTCCR         LSECSSON        LL_RCC_LSE_EnableCSS
  */
__STATIC_INLINE void LL_RCC_LSE_EnableCSS(void)
{
  STM32_SET_BIT(RCC->RTCCR, RCC_RTCCR_LSECSSON);
}

/**
  * @brief  Disable LSE clock security system (LSE CSSON).
  * @rmtoll
  *  RTCCR         LSECSSON        LL_RCC_LSE_DisableCSS
  */
__STATIC_INLINE void LL_RCC_LSE_DisableCSS(void)
{
  STM32_CLEAR_BIT(RCC->RTCCR, RCC_RTCCR_LSECSSON);
}

/**
  * @brief  Check if CSS on LSE failure Detection.
  * @rmtoll
  *  RTCCR         LSECSSD       LL_RCC_LSE_IsCSSDetected
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsCSSDetected(void)
{
  return ((STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSECSSD) == RCC_RTCCR_LSECSSD) ? 1UL : 0UL);
}

/**
  * @}
  */ /* End of RCC_LL_EF_LSE */

/** @defgroup RCC_LL_EF_HSI HSI
  * @{
  */
/**
  * @brief  Enable HSIS clock (HSIS ON).
  * @rmtoll
  *  CR1           HSISON        LL_RCC_HSIS_Enable
  */
__STATIC_INLINE void LL_RCC_HSIS_Enable(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSISON);
}

/**
  * @brief  Disable HSIS clock (HSIS ON).
  * @rmtoll
  *  CR1           HSISON        LL_RCC_HSIS_Disable
  */
__STATIC_INLINE void LL_RCC_HSIS_Disable(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_HSISON);
}

/**
  * @brief  Check if HSIS oscillator is enabled.
  * @rmtoll
  *  CR1           HSISON        LL_RCC_HSIS_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSIS_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSISON) == RCC_CR1_HSISON) ? 1UL : 0UL);
}

/**
  * @brief  Enable HSIDIV3 clock (HSIDIV3 ON).
  * @rmtoll
  *  CR1           HSIDIV3ON        LL_RCC_HSIDIV3_Enable
  */
__STATIC_INLINE void LL_RCC_HSIDIV3_Enable(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSIDIV3ON);
}

/**
  * @brief  Disable HSIDIV3 clock (HSIDIV3 ON).
  * @rmtoll
  *  CR1           HSIDIV3ON        LL_RCC_HSIDIV3_Disable
  */
__STATIC_INLINE void LL_RCC_HSIDIV3_Disable(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_HSIDIV3ON);
}

/**
  * @brief  Check if HSIDIV3 oscillator is enabled.
  * @rmtoll
  *  CR1           HSIDIV3ON        LL_RCC_HSIDIV3_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSIDIV3_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSIDIV3ON) == RCC_CR1_HSIDIV3ON) ? 1UL : 0UL);
}

/**
  * @brief  Enable HSIK clock (HSIK ON).
  * @rmtoll
  *  CR1           HSIKON        LL_RCC_HSIK_Enable
  */
__STATIC_INLINE void LL_RCC_HSIK_Enable(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSIKON);
}

/**
  * @brief  Disable HSIK clock (HSIK ON).
  * @rmtoll
  *  CR1           HSIKON        LL_RCC_HSIK_Disable
  */
__STATIC_INLINE void LL_RCC_HSIK_Disable(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_HSIKON);
}

/**
  * @brief  Check if HSIK oscillator is enabled.
  * @rmtoll
  *  CR1           HSIK        LL_RCC_HSIK_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSIK_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSIKON) == RCC_CR1_HSIKON) ? 1UL : 0UL);
}

/**
  * @brief  Enable HSI clock used as kernel clock for peripheral in Stop mode.
  * @rmtoll
  *  CR1           HSIKERON        LL_RCC_HSI_EnableInStopMode
  */
__STATIC_INLINE void LL_RCC_HSI_EnableInStopMode(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSIKERON);
}

/**
  * @brief  Disable HSI clock used as kernel clock for peripheral in Stop mode.
  * @rmtoll
  *  CR1           HSIKERON        LL_RCC_HSI_DisableInStopMode
  */
__STATIC_INLINE void LL_RCC_HSI_DisableInStopMode(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_HSIKERON);
}

/**
  * @brief  Check if HSI clock used as kernel clock for peripheral is enabled in stop mode.
  * @rmtoll
  *  CR1          HSIKERON        LL_RCC_HSI_IsEnabledInStopMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_IsEnabledInStopMode(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSIKERON) == RCC_CR1_HSIKERON) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSIS clock is ready.
  * @rmtoll
  *  CR1         HSISRDY         LL_RCC_HSIS_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSIS_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSISRDY) == RCC_CR1_HSISRDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSIDIV3 clock is ready.
  * @rmtoll
  *  CR1         HSIDIV3RDY         LL_RCC_HSIDIV3_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSIDIV3_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSIDIV3RDY) == RCC_CR1_HSIDIV3RDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSIK clock is ready.
  * @rmtoll
  *  CR1         HSIKRDY         LL_RCC_HSIK_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSIK_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSIKRDY) == RCC_CR1_HSIKRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set HSIK clock out divider factor (HSIK DIV).
  * @rmtoll
  *  CR2         HSIKDIV         LL_RCC_HSIK_SetDivider
  * @param  value This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HSIK_DIV_1
  *         @arg @ref LL_RCC_HSIK_DIV_1_5
  *         @arg @ref LL_RCC_HSIK_DIV_2
  *         @arg @ref LL_RCC_HSIK_DIV_2_5
  *         @arg @ref LL_RCC_HSIK_DIV_3
  *         @arg @ref LL_RCC_HSIK_DIV_3_5
  *         @arg @ref LL_RCC_HSIK_DIV_4
  *         @arg @ref LL_RCC_HSIK_DIV_4_5
  *         @arg @ref LL_RCC_HSIK_DIV_5
  *         @arg @ref LL_RCC_HSIK_DIV_5_5
  *         @arg @ref LL_RCC_HSIK_DIV_6
  *         @arg @ref LL_RCC_HSIK_DIV_6_5
  *         @arg @ref LL_RCC_HSIK_DIV_7
  *         @arg @ref LL_RCC_HSIK_DIV_7_5
  *         @arg @ref LL_RCC_HSIK_DIV_8
  */
__STATIC_INLINE void LL_RCC_HSIK_SetDivider(uint32_t value)
{
  STM32_MODIFY_REG(RCC->CR2, RCC_CR2_HSIKDIV, value);
}

/**
  * @brief  Get HSIK clock out divider factor (HSIK DIV).
  * @rmtoll
  *  CR2         HSIKDIV         LL_RCC_HSIK_GetDivider
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_HSIK_DIV_1
  *         @arg @ref LL_RCC_HSIK_DIV_1_5
  *         @arg @ref LL_RCC_HSIK_DIV_2
  *         @arg @ref LL_RCC_HSIK_DIV_2_5
  *         @arg @ref LL_RCC_HSIK_DIV_3
  *         @arg @ref LL_RCC_HSIK_DIV_3_5
  *         @arg @ref LL_RCC_HSIK_DIV_4
  *         @arg @ref LL_RCC_HSIK_DIV_4_5
  *         @arg @ref LL_RCC_HSIK_DIV_5
  *         @arg @ref LL_RCC_HSIK_DIV_5_5
  *         @arg @ref LL_RCC_HSIK_DIV_6
  *         @arg @ref LL_RCC_HSIK_DIV_6_5
  *         @arg @ref LL_RCC_HSIK_DIV_7
  *         @arg @ref LL_RCC_HSIK_DIV_7_5
  *         @arg @ref LL_RCC_HSIK_DIV_8
   */
__STATIC_INLINE uint32_t LL_RCC_HSIK_GetDivider(void)
{
  return (STM32_READ_BIT(RCC->CR2, RCC_CR2_HSIKDIV));
}

/**
  * @}
  */ /* End of RCC_LL_EF_HSI */

/** @defgroup RCC_LL_EF_PSI PSI
  * @{
  */
/**
  * @brief  Enable PSIS clock (PSIS ON).
  * @rmtoll
  *  CR1           PSISON        LL_RCC_PSIS_Enable
  */
__STATIC_INLINE void LL_RCC_PSIS_Enable(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_PSISON);
}

/**
  * @brief  Disable PSIS clock (PSIS ON).
  * @rmtoll
  *  CR1           PSISON        LL_RCC_PSIS_Disable
  */
__STATIC_INLINE void LL_RCC_PSIS_Disable(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_PSISON);
}

/**
  * @brief  Check if PSIS oscillator is enabled.
  * @rmtoll
  *  CR1           PSISON        LL_RCC_PSIS_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PSIS_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_PSISON) == RCC_CR1_PSISON) ? 1UL : 0UL);
}

/**
  * @brief  Enable PSIDIV3 clock (PSIDIV3 ON).
  * @rmtoll
  *  CR1           PSIDIV3ON        LL_RCC_PSIDIV3_Enable
  */
__STATIC_INLINE void LL_RCC_PSIDIV3_Enable(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_PSIDIV3ON);
}

/**
  * @brief  Disable PSIDIV3 clock (PSIDIV3 ON).
  * @rmtoll
  *  CR1           PSIDIV3ON        LL_RCC_PSIDIV3_Disable
  */
__STATIC_INLINE void LL_RCC_PSIDIV3_Disable(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_PSIDIV3ON);
}

/**
  * @brief  Check if PSIDIV3ON oscillator is enabled.
  * @rmtoll
  *  CR1           PSIDIV3ON        LL_RCC_PSIDIV3_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PSIDIV3_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_PSIDIV3ON) == RCC_CR1_PSIDIV3ON) ? 1UL : 0UL);
}

/**
  * @brief  Enable PSIK clock (PSIK ON).
  * @rmtoll
  *  CR1           PSIKON        LL_RCC_PSIK_Enable
  */
__STATIC_INLINE void LL_RCC_PSIK_Enable(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_PSIKON);
}

/**
  * @brief  Disable PSIK clock (PSIK ON).
  * @rmtoll
  *  CR1           PSIKON        LL_RCC_PSIK_Disable
  */
__STATIC_INLINE void LL_RCC_PSIK_Disable(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_PSIKON);
}

/**
  * @brief  Check if PSIKON oscillator is enabled.
  * @rmtoll
  *  CR1           PSIKON        LL_RCC_PSIK_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PSIK_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_PSIKON) == RCC_CR1_PSIKON) ? 1UL : 0UL);
}

/**
  * @brief  Enable PSI clock in Stop mode.
  * @rmtoll
  *  CR1           PSIKERON        LL_RCC_PSI_EnableInStopMode
  */
__STATIC_INLINE void LL_RCC_PSI_EnableInStopMode(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_PSIKERON);
}

/**
  * @brief  Disable PSI clock in Stop mode.
  * @rmtoll
  *  CR1           PSIKERON        LL_RCC_PSI_DisableInStopMode
  */
__STATIC_INLINE void LL_RCC_PSI_DisableInStopMode(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_PSIKERON);
}

/**
  * @brief  Check if PSI is enabled in stop mode.
  * @rmtoll
  *  CR1           PSIKERON        LL_RCC_PSI_IsEnabledInStopMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PSI_IsEnabledInStopMode(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_PSIKERON) == RCC_CR1_PSIKERON) ? 1UL : 0UL);
}

/**
  * @brief  Check if PSIS clock is ready.
  * @rmtoll
  *  CR1         PSISRDY         LL_RCC_PSIS_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PSIS_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_PSISRDY) == RCC_CR1_PSISRDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if PSIDIV3 clock is ready.
  * @rmtoll
  *  CR1         PSIDIV3RDY         LL_RCC_PSIDIV3_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PSIDIV3_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_PSIDIV3RDY) == RCC_CR1_PSIDIV3RDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if PSIK clock is ready.
  * @rmtoll
  *  CR1         PSIKRDY         LL_RCC_PSIK_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PSIK_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_PSIKRDY) == RCC_CR1_PSIKRDY) ? 1UL : 0UL);
}

