MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/**
  * @brief  Set PSIK clock out divider factor (PSIK DIV).
  * @rmtoll
  *  CR2         PSIKDIV         LL_RCC_PSIK_SetDivider
  * @param  value This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSIK_DIV_1
  *         @arg @ref LL_RCC_PSIK_DIV_1_5
  *         @arg @ref LL_RCC_PSIK_DIV_2
  *         @arg @ref LL_RCC_PSIK_DIV_2_5
  *         @arg @ref LL_RCC_PSIK_DIV_3
  *         @arg @ref LL_RCC_PSIK_DIV_3_5
  *         @arg @ref LL_RCC_PSIK_DIV_4
  *         @arg @ref LL_RCC_PSIK_DIV_4_5
  *         @arg @ref LL_RCC_PSIK_DIV_5
  *         @arg @ref LL_RCC_PSIK_DIV_5_5
  *         @arg @ref LL_RCC_PSIK_DIV_6
  *         @arg @ref LL_RCC_PSIK_DIV_6_5
  *         @arg @ref LL_RCC_PSIK_DIV_7
  *         @arg @ref LL_RCC_PSIK_DIV_7_5
  *         @arg @ref LL_RCC_PSIK_DIV_8
  */
__STATIC_INLINE void LL_RCC_PSIK_SetDivider(uint32_t value)
{
  STM32_MODIFY_REG(RCC->CR2, RCC_CR2_PSIKDIV, value);
}

/**
  * @brief  Get PSIK clock out divider factor (PSIK DIV).
  * @rmtoll
  *  CR2         PSIKDIV         LL_RCC_PSIK_GetDivider
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PSIK_DIV_1
  *         @arg @ref LL_RCC_PSIK_DIV_1_5
  *         @arg @ref LL_RCC_PSIK_DIV_2
  *         @arg @ref LL_RCC_PSIK_DIV_2_5
  *         @arg @ref LL_RCC_PSIK_DIV_3
  *         @arg @ref LL_RCC_PSIK_DIV_3_5
  *         @arg @ref LL_RCC_PSIK_DIV_4
  *         @arg @ref LL_RCC_PSIK_DIV_4_5
  *         @arg @ref LL_RCC_PSIK_DIV_5
  *         @arg @ref LL_RCC_PSIK_DIV_5_5
  *         @arg @ref LL_RCC_PSIK_DIV_6
  *         @arg @ref LL_RCC_PSIK_DIV_6_5
  *         @arg @ref LL_RCC_PSIK_DIV_7
  *         @arg @ref LL_RCC_PSIK_DIV_7_5
  *         @arg @ref LL_RCC_PSIK_DIV_8
   */
__STATIC_INLINE uint32_t LL_RCC_PSIK_GetDivider(void)
{
  return (STM32_READ_BIT(RCC->CR2, RCC_CR2_PSIKDIV));
}

/**
  * @brief  Configure the PSI target frequency output.
  * @rmtoll
  *  CR2         PSIFREQ         LL_RCC_SetPSIFreqOutput
  * @param  freq This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSIFREQ_100MHZ
  *         @arg @ref LL_RCC_PSIFREQ_144MHZ
  *         @arg @ref LL_RCC_PSIFREQ_160MHZ
  */
__STATIC_INLINE void LL_RCC_SetPSIFreqOutput(uint32_t freq)
{
  STM32_MODIFY_REG(RCC->CR2, RCC_CR2_PSIFREQ, freq);
}

/**
  * @brief  Get the PSI target frequency output.
  * @rmtoll
  *  CR2         PSIFREQ         LL_RCC_GetPSIFreqOutput
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PSIFREQ_100MHZ
  *         @arg @ref LL_RCC_PSIFREQ_144MHZ
  *         @arg @ref LL_RCC_PSIFREQ_160MHZ
  */
__STATIC_INLINE uint32_t LL_RCC_GetPSIFreqOutput(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CR2, RCC_CR2_PSIFREQ));
}

/**
  * @brief  Configure the PSI ref clock frequency selection.
  * @rmtoll
  *  CR2         PSIREF         LL_RCC_SetPSIRef
  * @param  source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSIREF_32768HZ
  *         @arg @ref LL_RCC_PSIREF_8MHZ
  *         @arg @ref LL_RCC_PSIREF_16MHZ
  *         @arg @ref LL_RCC_PSIREF_24MHZ
  *         @arg @ref LL_RCC_PSIREF_25MHZ
  *         @arg @ref LL_RCC_PSIREF_32MHZ
  *         @arg @ref LL_RCC_PSIREF_48MHZ
  *         @arg @ref LL_RCC_PSIREF_50MHZ
  */
__STATIC_INLINE void LL_RCC_SetPSIRef(uint32_t source)
{
  STM32_MODIFY_REG(RCC->CR2, RCC_CR2_PSIREF, source);
}

/**
  * @brief  Get the PSI ref clock frequency selection.
  * @rmtoll
  *  CR2         PSIREF         LL_RCC_GetPSIRef
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PSIREF_32768HZ
  *         @arg @ref LL_RCC_PSIREF_8MHZ
  *         @arg @ref LL_RCC_PSIREF_16MHZ
  *         @arg @ref LL_RCC_PSIREF_24MHZ
  *         @arg @ref LL_RCC_PSIREF_25MHZ
  *         @arg @ref LL_RCC_PSIREF_32MHZ
  *         @arg @ref LL_RCC_PSIREF_48MHZ
  *         @arg @ref LL_RCC_PSIREF_50MHZ
  */
__STATIC_INLINE uint32_t LL_RCC_GetPSIRef(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CR2, RCC_CR2_PSIREF));
}

/**
  * @brief  Configure the PSI clock source.
  * @rmtoll
  *  CR2         PSIREFSRC         LL_RCC_SetPSIClkSource
  * @param  ref This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSISOURCE_HSE
  *         @arg @ref LL_RCC_PSISOURCE_LSE
  *         @arg @ref LL_RCC_PSISOURCE_HSIDIV18
  */
__STATIC_INLINE void LL_RCC_SetPSIClkSource(uint32_t ref)
{
  STM32_MODIFY_REG(RCC->CR2, RCC_CR2_PSIREFSRC, ref);
}

/**
  * @brief  Get the PSI clock source.
  * @rmtoll
  *  CR2         PSIREFSRC         LL_RCC_GetPSIClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PSISOURCE_HSE
  *         @arg @ref LL_RCC_PSISOURCE_LSE
  *         @arg @ref LL_RCC_PSISOURCE_HSIDIV18
  */
__STATIC_INLINE uint32_t LL_RCC_GetPSIClkSource(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CR2, RCC_CR2_PSIREFSRC));
}

/**
  * @brief  Configure the PSI clock.
  * @rmtoll
  *  CR2         PSIFREQ           LL_RCC_ConfigPSI \n
  *  CR2         PSIREF            LL_RCC_ConfigPSI \n
  *  CR2         PSIREFSRC         LL_RCC_ConfigPSI
  * @param  freq This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSIFREQ_100MHZ
  *         @arg @ref LL_RCC_PSIFREQ_144MHZ
  *         @arg @ref LL_RCC_PSIFREQ_160MHZ
  * @param  ref This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSIREF_32768HZ
  *         @arg @ref LL_RCC_PSIREF_8MHZ
  *         @arg @ref LL_RCC_PSIREF_16MHZ
  *         @arg @ref LL_RCC_PSIREF_24MHZ
  *         @arg @ref LL_RCC_PSIREF_25MHZ
  *         @arg @ref LL_RCC_PSIREF_32MHZ
  *         @arg @ref LL_RCC_PSIREF_48MHZ
  *         @arg @ref LL_RCC_PSIREF_50MHZ
  * @param  source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSISOURCE_HSE
  *         @arg @ref LL_RCC_PSISOURCE_LSE
  *         @arg @ref LL_RCC_PSISOURCE_HSIDIV18
  */
__STATIC_INLINE void LL_RCC_ConfigPSI(uint32_t freq, uint32_t ref, uint32_t source)
{
  STM32_MODIFY_REG(RCC->CR2, (RCC_CR2_PSIFREQ | RCC_CR2_PSIREF | RCC_CR2_PSIREFSRC), (freq | ref | source));
}

/**
  * @brief  Get PSI configuration.
  * @rmtoll
  *  CR2         PSIFREQ           LL_RCC_GetConfigPSI \n
  *  CR2         PSIREF            LL_RCC_GetConfigPSI \n
  *  CR2         PSIREFSRC         LL_RCC_GetConfigPSI
  * @param  p_freq Pointer on LL_RCC_PSIFREQ
  * @param  p_ref Pointer on LL_RCC_PSIREF
  * @param  p_source Pointer on LL_RCC_PSISOURCE
  */
__STATIC_INLINE void LL_RCC_GetConfigPSI(uint32_t *p_freq, uint32_t *p_ref, uint32_t *p_source)
{
  const volatile uint32_t Reg = STM32_READ_REG(RCC->CR2);

  *p_freq = (uint32_t)(Reg & RCC_CR2_PSIFREQ);
  *p_ref = (uint32_t)(Reg & RCC_CR2_PSIREF);
  *p_source = (uint32_t)(Reg & RCC_CR2_PSIREFSRC);
}

/**
  * @}
  */ /* End of RCC_LL_EF_PSI */

