MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/** @defgroup RCC_LL_EF_HSE HSE
  * @{
  */

/**
  * @brief  Enable HSE clock (HSE ON).
  * @rmtoll
  *  CR1           HSEON        LL_RCC_HSE_Enable
  */
__STATIC_INLINE void LL_RCC_HSE_Enable(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSEON);
}

/**
  * @brief  Disable HSE clock (HSE ON).
  * @rmtoll
  *  CR1           HSEON        LL_RCC_HSE_Disable
  */
__STATIC_INLINE void LL_RCC_HSE_Disable(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_HSEON);
}

/**
  * @brief  Check if HSE oscillator is enabled.
  * @rmtoll
  *  CR1           HSEON        LL_RCC_HSE_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsEnabled(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSEON) == RCC_CR1_HSEON) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSE clock is ready.
  * @rmtoll
  *  CR1         HSERDY         LL_RCC_HSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsReady(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSERDY) == RCC_CR1_HSERDY) ? 1UL : 0UL);
}

/**
  * @brief  Set external HSE clock mode.
  * @rmtoll
  *  CR1        HSEEXT        LL_RCC_HSE_SetClockMode
  * @param  hse_mode This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HSE_ANALOG_MODE
  *         @arg @ref LL_RCC_HSE_DIGITAL_MODE
  * @note This bit can be written only if the HSE oscillator is disabled.
  */
__STATIC_INLINE void LL_RCC_HSE_SetClockMode(uint32_t hse_mode)
{
  STM32_MODIFY_REG(RCC->CR1, RCC_CR1_HSEEXT, hse_mode);
}

/**
  * @brief  Get External HSE clock mode.
  * @rmtoll
  *  CR1        HSEEXT        LL_RCC_HSE_GetClockMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_HSE_ANALOG_MODE
  *         @arg @ref LL_RCC_HSE_DIGITAL_MODE
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_GetClockMode(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CR1, RCC_CR1_HSEEXT));
}

/**
  * @brief  Enable HSE external oscillator (HSE Bypass).
  * @rmtoll
  *  CR1          HSEBYP        LL_RCC_HSE_EnableBypass
  */
__STATIC_INLINE void LL_RCC_HSE_EnableBypass(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSEBYP);
}

/**
  * @brief  Configure HSE external oscillator in bypass.
  * @rmtoll
  *  CR1        HSEBYP        LL_RCC_HSE_ConfigBypass \n
  *  CR1        HSEEXT        LL_RCC_HSE_ConfigBypass
  * @param  hse_mode This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HSE_ANALOG_MODE
  *         @arg @ref LL_RCC_HSE_DIGITAL_MODE
  */
__STATIC_INLINE void LL_RCC_HSE_ConfigBypass(uint32_t hse_mode)
{
  STM32_MODIFY_REG(RCC->CR1, RCC_CR1_HSEBYP | RCC_CR1_HSEEXT, RCC_CR1_HSEBYP | hse_mode);
}

/**
  * @brief  Disable HSE external oscillator (HSE Bypass).
  * @rmtoll
  *  CR1          HSEBYP        LL_RCC_HSE_DisableBypass
  */
__STATIC_INLINE void LL_RCC_HSE_DisableBypass(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_HSEBYP);
}

/**
  * @brief  Check if HSE is bypassed.
  * @rmtoll
  *  CR1          HSEBYP        LL_RCC_HSE_IsBypassed
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsBypassed(void)
{
  return ((STM32_READ_BIT(RCC->CR1, RCC_CR1_HSEBYP) == RCC_CR1_HSEBYP) ? 1UL : 0UL);
}

/**
  * @brief  Select the Analog HSE external clock type in Bypass mode.
  * @rmtoll
  *  CR1           HSEEXT        LL_RCC_HSE_SelectAnalogClock
  */
__STATIC_INLINE void LL_RCC_HSE_SelectAnalogClock(void)
{
  STM32_CLEAR_BIT(RCC->CR1, RCC_CR1_HSEEXT);
}

/**
  * @brief  Select the Digital HSE external clock type in Bypass mode.
  * @rmtoll
  *  CR1           HSEEXT        LL_RCC_HSE_SelectDigitalClock
  */
__STATIC_INLINE void LL_RCC_HSE_SelectDigitalClock(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSEEXT);
}

/**
  * @brief  Enable HSE clock security system.
  * @rmtoll
  *  CR1           HSECSSON        LL_RCC_HSE_EnableCSS
  */
__STATIC_INLINE void LL_RCC_HSE_EnableCSS(void)
{
  STM32_SET_BIT(RCC->CR1, RCC_CR1_HSECSSON);
}

/**
  * @}
  */ /* End of RCC_LL_EF_HSE */


/** @defgroup RCC_LL_EF_LSCO LSCO
  * @{
  */

/**
  * @brief  Enable Low speed clock.
  * @rmtoll
  *  RTCCR         LSCOEN        LL_RCC_LSCO_Enable
  */
__STATIC_INLINE void LL_RCC_LSCO_Enable(void)
{
  STM32_SET_BIT(RCC->RTCCR, RCC_RTCCR_LSCOEN);
}

/**
  * @brief  Disable Low speed clock.
  * @rmtoll
  *  RTCCR         LSCOEN        LL_RCC_LSCO_Disable
  */
__STATIC_INLINE void LL_RCC_LSCO_Disable(void)
{
  STM32_CLEAR_BIT(RCC->RTCCR, RCC_RTCCR_LSCOEN);
}

/**
  * @brief  Configure Low speed clock selection.
  * @rmtoll
  *  RTCCR         LSCOSEL       LL_RCC_LSCO_SetSource
  * @param  source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSE
  */
__STATIC_INLINE void LL_RCC_LSCO_SetSource(uint32_t source)
{
  STM32_MODIFY_REG(RCC->RTCCR, RCC_RTCCR_LSCOSEL, source);
}

/**
  * @brief  Get Low speed clock selection.
  * @rmtoll
  *  RTCCR         LSCOSEL       LL_RCC_LSCO_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_LSCO_GetSource(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_LSCOSEL));
}

/**
  * @brief  Configure Low speed clock.
  * @rmtoll
  *  RTCCR         LSCOSEL       LL_RCC_ConfigLSCO \n
  *  RTCCR         LSCOEN        LL_RCC_ConfigLSCO
  * @param  source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSE
  * @note  PWR and backup domain must be previously enabled.
  */
__STATIC_INLINE void LL_RCC_ConfigLSCO(uint32_t source)
{
  STM32_MODIFY_REG(RCC->RTCCR, RCC_RTCCR_LSCOSEL | RCC_RTCCR_LSCOEN, source | RCC_RTCCR_LSCOEN);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_System System
  * @{
  */

/**
  * @brief  Configure the system clock source.
  * @rmtoll
  *  CFGR1         SW         LL_RCC_SetSysClkSource
  * @param  source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSIDIV3
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSIS
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_PSIS
  */
__STATIC_INLINE void LL_RCC_SetSysClkSource(uint32_t source)
{
  STM32_MODIFY_REG(RCC->CFGR1, RCC_CFGR1_SW, source);
}

/**
  * @brief  Get the system clock source.
  * @rmtoll
  *  CFGR1         SWS         LL_RCC_GetSysClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_STATUS_HSIDIV3
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_STATUS_HSIS
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_STATUS_HSE
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_STATUS_PSIS
  */
__STATIC_INLINE uint32_t LL_RCC_GetSysClkSource(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CFGR1, RCC_CFGR1_SWS));
}

/**
  * @brief  Set AHB prescaler.
  * @rmtoll
  *  CFGR2         HPRE         LL_RCC_SetAHBPrescaler
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HCLK_PRESCALER_1
  *         @arg @ref LL_RCC_HCLK_PRESCALER_2
  *         @arg @ref LL_RCC_HCLK_PRESCALER_4
  *         @arg @ref LL_RCC_HCLK_PRESCALER_8
  *         @arg @ref LL_RCC_HCLK_PRESCALER_16
  *         @arg @ref LL_RCC_HCLK_PRESCALER_64
  *         @arg @ref LL_RCC_HCLK_PRESCALER_128
  *         @arg @ref LL_RCC_HCLK_PRESCALER_256
  *         @arg @ref LL_RCC_HCLK_PRESCALER_512
  */
__STATIC_INLINE void LL_RCC_SetAHBPrescaler(uint32_t prescaler)
{
  STM32_MODIFY_REG(RCC->CFGR2, RCC_CFGR2_HPRE, prescaler);
}

/**
  * @brief  Get AHB prescaler.
  * @rmtoll
  *  CFGR2         HPRE         LL_RCC_GetAHBPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_HCLK_PRESCALER_1
  *         @arg @ref LL_RCC_HCLK_PRESCALER_2
  *         @arg @ref LL_RCC_HCLK_PRESCALER_4
  *         @arg @ref LL_RCC_HCLK_PRESCALER_8
  *         @arg @ref LL_RCC_HCLK_PRESCALER_16
  *         @arg @ref LL_RCC_HCLK_PRESCALER_64
  *         @arg @ref LL_RCC_HCLK_PRESCALER_128
  *         @arg @ref LL_RCC_HCLK_PRESCALER_256
  *         @arg @ref LL_RCC_HCLK_PRESCALER_512
  */
__STATIC_INLINE uint32_t LL_RCC_GetAHBPrescaler(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_HPRE));
}

/**
  * @brief  Set Systick clock source.
  * @rmtoll
  *  CCIPR2         SYSTICKSEL         LL_RCC_SetSystickClockSource
  * @param  SystickSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSE
  */
__STATIC_INLINE void LL_RCC_SetSystickClockSource(uint32_t SystickSource)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_SYSTICKSEL, SystickSource);
}

/**
  * @brief  Get Sysctick clock source.
  * @rmtoll
  *  CCIPR2         SYSTICKSEL         LL_RCC_GetSystickClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSystickClockSource(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR2, RCC_CCIPR2_SYSTICKSEL));
}

/**
  * @brief  Set APB1 prescaler.
  * @rmtoll
  *  CFGR2         PPRE1         LL_RCC_SetAPB1Prescaler
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_PRESCALER_1
  *         @arg @ref LL_RCC_APB1_PRESCALER_2
  *         @arg @ref LL_RCC_APB1_PRESCALER_4
  *         @arg @ref LL_RCC_APB1_PRESCALER_8
  *         @arg @ref LL_RCC_APB1_PRESCALER_16
  */
__STATIC_INLINE void LL_RCC_SetAPB1Prescaler(uint32_t prescaler)
{
  STM32_MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE1, prescaler);
}

/**
  * @brief  Get APB1 prescaler.
  * @rmtoll
  *  CFGR2         PPRE1         LL_RCC_GetAPB1Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB1_PRESCALER_1
  *         @arg @ref LL_RCC_APB1_PRESCALER_2
  *         @arg @ref LL_RCC_APB1_PRESCALER_4
  *         @arg @ref LL_RCC_APB1_PRESCALER_8
  *         @arg @ref LL_RCC_APB1_PRESCALER_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB1Prescaler(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_PPRE1));
}

/**
  * @brief  Set APB2 prescaler.
  * @rmtoll
  *  CFGR2         PPRE2         LL_RCC_SetAPB2Prescaler
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_PRESCALER_1
  *         @arg @ref LL_RCC_APB2_PRESCALER_2
  *         @arg @ref LL_RCC_APB2_PRESCALER_4
  *         @arg @ref LL_RCC_APB2_PRESCALER_8
  *         @arg @ref LL_RCC_APB2_PRESCALER_16
  */
__STATIC_INLINE void LL_RCC_SetAPB2Prescaler(uint32_t prescaler)
{
  STM32_MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE2, prescaler);
}

/**
  * @brief  Get APB2 prescaler.
  * @rmtoll
  *  CFGR2         PPRE2         LL_RCC_GetAPB2Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB2_PRESCALER_1
  *         @arg @ref LL_RCC_APB2_PRESCALER_2
  *         @arg @ref LL_RCC_APB2_PRESCALER_4
  *         @arg @ref LL_RCC_APB2_PRESCALER_8
  *         @arg @ref LL_RCC_APB2_PRESCALER_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB2Prescaler(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_PPRE2));
}

/**
  * @brief  Set APB3 prescaler.
  * @rmtoll
  *  CFGR2         PPRE3         LL_RCC_SetAPB3Prescaler
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB3_PRESCALER_1
  *         @arg @ref LL_RCC_APB3_PRESCALER_2
  *         @arg @ref LL_RCC_APB3_PRESCALER_4
  *         @arg @ref LL_RCC_APB3_PRESCALER_8
  *         @arg @ref LL_RCC_APB3_PRESCALER_16
  */
__STATIC_INLINE void LL_RCC_SetAPB3Prescaler(uint32_t prescaler)
{
  STM32_MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE3, prescaler);
}

/**
  * @brief  Get APB3 prescaler.
  * @rmtoll
  *  CFGR2         PPRE3         LL_RCC_GetAPB3Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB3_PRESCALER_1
  *         @arg @ref LL_RCC_APB3_PRESCALER_2
  *         @arg @ref LL_RCC_APB3_PRESCALER_4
  *         @arg @ref LL_RCC_APB3_PRESCALER_8
  *         @arg @ref LL_RCC_APB3_PRESCALER_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB3Prescaler(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_PPRE3));
}

/**
  * @brief  Configure buses prescalers (AHB, APB1, APB2, APB3).
  * @rmtoll
  *  CFGR2         HPRE         LL_RCC_ConfigBusClock \n
  *  CFGR2         PPRE1        LL_RCC_ConfigBusClock \n
  *  CFGR2         PPRE2        LL_RCC_ConfigBusClock \n
  *  CFGR2         PPRE3        LL_RCC_ConfigBusClock
  * @param  ahb_apb1_apb2_apb3pres Bus Prescalers values of AHB, ABP1 , ABP2 and ABP3
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RCC_HCLK_PRESCALER_1
  *         @arg @ref LL_RCC_HCLK_PRESCALER_2
  *         @arg @ref LL_RCC_HCLK_PRESCALER_4
  *         @arg @ref LL_RCC_HCLK_PRESCALER_8
  *         @arg @ref LL_RCC_HCLK_PRESCALER_16
  *         @arg @ref LL_RCC_HCLK_PRESCALER_64
  *         @arg @ref LL_RCC_HCLK_PRESCALER_128
  *         @arg @ref LL_RCC_HCLK_PRESCALER_256
  *         @arg @ref LL_RCC_HCLK_PRESCALER_512
  *         @arg @ref LL_RCC_APB1_PRESCALER_1
  *         @arg @ref LL_RCC_APB1_PRESCALER_2
  *         @arg @ref LL_RCC_APB1_PRESCALER_4
  *         @arg @ref LL_RCC_APB1_PRESCALER_8
  *         @arg @ref LL_RCC_APB1_PRESCALER_16
  *         @arg @ref LL_RCC_APB2_PRESCALER_1
  *         @arg @ref LL_RCC_APB2_PRESCALER_2
  *         @arg @ref LL_RCC_APB2_PRESCALER_4
  *         @arg @ref LL_RCC_APB2_PRESCALER_8
  *         @arg @ref LL_RCC_APB2_PRESCALER_16
  *         @arg @ref LL_RCC_APB3_PRESCALER_1
  *         @arg @ref LL_RCC_APB3_PRESCALER_2
  *         @arg @ref LL_RCC_APB3_PRESCALER_4
  *         @arg @ref LL_RCC_APB3_PRESCALER_8
  *         @arg @ref LL_RCC_APB3_PRESCALER_16
  */
__STATIC_INLINE void LL_RCC_ConfigBusClock(uint32_t ahb_apb1_apb2_apb3pres)
{
  STM32_MODIFY_REG(RCC->CFGR2, (RCC_CFGR2_HPRE | RCC_CFGR2_PPRE1 | RCC_CFGR2_PPRE2 | RCC_CFGR2_PPRE3), \
                   ahb_apb1_apb2_apb3pres);
}

/**
  * @brief  Set Clock After Wake-Up From Stop mode.
  * @rmtoll
  *  CFGR1       STOPWUCK      LL_RCC_SetClkAfterWakeFromStop
  * @param  clock This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STOP_WAKEUPCLOCK_HSIDIV3
  *         @arg @ref LL_RCC_STOP_WAKEUPCLOCK_HSIS
  */
__STATIC_INLINE void LL_RCC_SetClkAfterWakeFromStop(uint32_t clock)
{
  STM32_MODIFY_REG(RCC->CFGR1, RCC_CFGR1_STOPWUCK, clock);
}

/**
  * @brief  Get Clock After Wake-Up From Stop mode.
  * @rmtoll
  *  CFGR1         STOPWUCK      LL_RCC_GetClkAfterWakeFromStop
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_STOP_WAKEUPCLOCK_HSIDIV3
  *         @arg @ref LL_RCC_STOP_WAKEUPCLOCK_HSIS
  */
__STATIC_INLINE uint32_t LL_RCC_GetClkAfterWakeFromStop(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CFGR1, RCC_CFGR1_STOPWUCK));
}

/**
  * @}
  */ /* RCC_LL_EF_System */

/** @defgroup RCC_LL_EF_MCO MCO
  * @{
  */
/**
  * @brief  Configure MCOx.
  * @rmtoll
  *  CFGR1         MCO1SEL         LL_RCC_ConfigMCO \n
  *  CFGR1         MCO2SEL         LL_RCC_ConfigMCO \n
  *  CFGR1         MCO1PRE         LL_RCC_ConfigMCO \n
  *  CFGR1         MCO2PRE         LL_RCC_ConfigMCO
  * @param  mcox_source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO1SOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCO1SOURCE_HSE
  *         @arg @ref LL_RCC_MCO1SOURCE_LSE
  *         @arg @ref LL_RCC_MCO1SOURCE_LSI
  *         @arg @ref LL_RCC_MCO1SOURCE_PSIK
  *         @arg @ref LL_RCC_MCO1SOURCE_HSIK
  *         @arg @ref LL_RCC_MCO1SOURCE_PSIS
  *         @arg @ref LL_RCC_MCO1SOURCE_HSIS
  *         @arg @ref LL_RCC_MCO2SOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCO2SOURCE_HSE
  *         @arg @ref LL_RCC_MCO2SOURCE_LSE
  *         @arg @ref LL_RCC_MCO2SOURCE_LSI
  *         @arg @ref LL_RCC_MCO2SOURCE_PSIK
  *         @arg @ref LL_RCC_MCO2SOURCE_HSIK
  *         @arg @ref LL_RCC_MCO2SOURCE_PSIDIV3
  *         @arg @ref LL_RCC_MCO2SOURCE_HSIDIV3
  * @param  mcox_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO1SOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCO1_PRESCALER_1
  *         @arg @ref LL_RCC_MCO1_PRESCALER_2
  *         @arg @ref LL_RCC_MCO1_PRESCALER_3
  *         @arg @ref LL_RCC_MCO1_PRESCALER_4
  *         @arg @ref LL_RCC_MCO1_PRESCALER_5
  *         @arg @ref LL_RCC_MCO1_PRESCALER_6
  *         @arg @ref LL_RCC_MCO1_PRESCALER_7
  *         @arg @ref LL_RCC_MCO1_PRESCALER_8
  *         @arg @ref LL_RCC_MCO1_PRESCALER_9
  *         @arg @ref LL_RCC_MCO1_PRESCALER_10
  *         @arg @ref LL_RCC_MCO1_PRESCALER_11
  *         @arg @ref LL_RCC_MCO1_PRESCALER_12
  *         @arg @ref LL_RCC_MCO1_PRESCALER_13
  *         @arg @ref LL_RCC_MCO1_PRESCALER_14
  *         @arg @ref LL_RCC_MCO1_PRESCALER_15
  *         @arg @ref LL_RCC_MCO1SOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCO2_PRESCALER_1
  *         @arg @ref LL_RCC_MCO2_PRESCALER_2
  *         @arg @ref LL_RCC_MCO2_PRESCALER_3
  *         @arg @ref LL_RCC_MCO2_PRESCALER_4
  *         @arg @ref LL_RCC_MCO2_PRESCALER_5
  *         @arg @ref LL_RCC_MCO2_PRESCALER_6
  *         @arg @ref LL_RCC_MCO2_PRESCALER_7
  *         @arg @ref LL_RCC_MCO2_PRESCALER_8
  *         @arg @ref LL_RCC_MCO2_PRESCALER_9
  *         @arg @ref LL_RCC_MCO2_PRESCALER_10
  *         @arg @ref LL_RCC_MCO2_PRESCALER_11
  *         @arg @ref LL_RCC_MCO2_PRESCALER_12
  *         @arg @ref LL_RCC_MCO2_PRESCALER_13
  *         @arg @ref LL_RCC_MCO2_PRESCALER_14
  *         @arg @ref LL_RCC_MCO2_PRESCALER_15
  * @note   The clock provided to the MCOx outputs must not exceed the maximum IO speed,
  *         refer to the product datasheet for information about the supported IO speed.
  */
__STATIC_INLINE void LL_RCC_ConfigMCO(uint32_t mcox_source, uint32_t mcox_prescaler)
{
  STM32_MODIFY_REG(RCC->CFGR1, (mcox_source << 16U) | (mcox_prescaler << 16U), \
                   (mcox_source & 0xFFFF0000U) | (mcox_prescaler & 0xFFFF0000U));
}
/**
  * @}
  */ /* End of RCC_LL_EF_MCO */

/** @defgroup RCC_LL_EF_Peripheral_Clock_Source Peripheral Clock Source
  * @{
  */

