MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/**
  * @brief  Configure peripheral clock source.
  * @rmtoll
  *  CCIPR1         *         LL_RCC_SetClockSource \n
  *  CCIPR2         *         LL_RCC_SetClockSource \n
  *  CCIPR3         *         LL_RCC_SetClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_LSE
  * @if USART3
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PSIK (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSIK (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE (*)
  * @endif
  * @if USART6
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_LSE   (*)
  * @endif
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_LSE
  * @if UART7
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PCLK1  (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_HSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_LSE    (*)
  * @endif
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_AUDIOCLK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_AUDIOCLK
  * @if SPI3
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1    (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PSIK     (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_HSIK     (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_AUDIOCLK (*)
  * @endif
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_HSIK
  * @if I2C2
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1   (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PSIK    (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_HSIK    (*)
  * @endif
  * @if ETH1
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_RMII  (*)
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_FB    (*)
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_HCLK  (*)
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIS  (*)
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_NONE     (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIS     (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIK     (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_HSE      (*)
  * @endif
  * @if XSPI1
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HCLK    (*)
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_PSIK    (*)
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HSIK    (*)
  * @endif
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_RCC_SetClockSource(uint32_t clk_src)
{
  volatile uint32_t *pReg = (uint32_t *)((uint32_t)&RCC->CCIPR1 + LL_CLKSOURCE_REG(clk_src));
  STM32_MODIFY_REG(*pReg, LL_CLKSOURCE_MASK(clk_src), LL_CLKSOURCE_CONFIG(clk_src));
}
/**
  * @brief  Configure USARTx clock source.
  * @rmtoll
  *  CCIPR1         USART1SEL         LL_RCC_SetUSARTClockSource \n
  *  CCIPR1         USART2SEL         LL_RCC_SetUSARTClockSource \n
  *  CCIPR1         USART3SEL         LL_RCC_SetUSARTClockSource \n
  *  CCIPR1         USART6SEL         LL_RCC_SetUSARTClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_LSE
  * @if USART3
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSIK  (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE   (*)
  * @endif
  * @if USART6
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_LSE   (*)
  * @endif
  */
__STATIC_INLINE void LL_RCC_SetUSARTClockSource(uint32_t clk_src)
{
  LL_RCC_SetClockSource(clk_src);
}
/**
  * @brief  Configure UARTx clock source.
  * @rmtoll
  *  CCIPR1         UART4SEL         LL_RCC_SetUARTClockSource \n
  *  CCIPR1         UART5SEL         LL_RCC_SetUARTClockSource \n
  *  CCIPR1         UART7SEL         LL_RCC_SetUARTClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_LSE
  * @if UART7
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PCLK1  (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_HSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_LSE    (*)
  * @endif
  */
__STATIC_INLINE void LL_RCC_SetUARTClockSource(uint32_t clk_src)
{
  LL_RCC_SetClockSource(clk_src);
}
/**
  * @brief  Configure LPUARTx clock source.
  * @rmtoll
  *  CCIPR1         LPUART1SEL         LL_RCC_SetLPUARTClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSI
  */
__STATIC_INLINE void LL_RCC_SetLPUARTClockSource(uint32_t clk_src)
{
  STM32_MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_LPUART1SEL, clk_src);
}
/**
  * @brief  Configure SPIx clock source.
  * @rmtoll
  *  CCIPR1         SPI1SEL         LL_RCC_SetSPIClockSource \n
  *  CCIPR1         SPI2SEL         LL_RCC_SetSPIClockSource \n
  *  CCIPR1         SPI3SEL         LL_RCC_SetSPIClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_AUDIOCLK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_AUDIOCLK
  * @if SPI3
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1     (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PSIK      (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_HSIK      (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_AUDIOCLK  (*)
  * @endif
  */
__STATIC_INLINE void LL_RCC_SetSPIClockSource(uint32_t clk_src)
{
  LL_RCC_SetClockSource(clk_src);
}
#if defined(FDCAN1)

/**
  * @brief  Configure FDCANx clock source.
  * @rmtoll
  *  CCIPR1         FDCANSEL         LL_RCC_SetFDCANClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_HSE
  */
__STATIC_INLINE void LL_RCC_SetFDCANClockSource(uint32_t clk_src)
{
  STM32_MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_FDCANSEL, clk_src);
}
#endif /* FDCAN1 */

/**
  * @brief  Configure I2Cx clock source.
  * @rmtoll
  *  CCIPR2         I2C1SEL         LL_RCC_SetI2CClockSource \n
  *  CCIPR2         I2C2SEL         LL_RCC_SetI2CClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_HSIK
  * @if I2C2
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_HSIK  (*)
  * @endif
  */
__STATIC_INLINE void LL_RCC_SetI2CClockSource(uint32_t clk_src)
{
  LL_RCC_SetClockSource(clk_src);
}

/**
  * @brief  Configure I3Cx clock source.
  * @rmtoll
  *  CCIPR2         I3C1SEL         LL_RCC_SetI3CClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_HSIK
  */
__STATIC_INLINE void LL_RCC_SetI3CClockSource(uint32_t clk_src)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_I3C1SEL, clk_src);
}
/**
  * @brief  Configure ADCDACx clock source.
  * @rmtoll
  *  CCIPR2         ADCDACSEL         LL_RCC_SetADCDACClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HSIK
  * @note This bit must not be changed when ADC or DAC enabled.
  */
__STATIC_INLINE void LL_RCC_SetADCDACClockSource(uint32_t clk_src)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_ADCDACSEL, clk_src);
}

/**
  * @brief  Configure ADCDACx clock prescaler.
  * @rmtoll
  *  CCIPR2         ADCDACPRE         LL_RCC_SetADCDACPrescaler
  * @param  Prescaler This parameter can be between the following values:
  *         @arg @ref LL_RCC_ADCDAC_PRESCALER_1
  *         @arg @ref LL_RCC_ADCDAC_PRESCALER_128
  * @note This bit must not be changed when ADC or DAC enabled.
  */
__STATIC_INLINE void LL_RCC_SetADCDACPrescaler(uint32_t Prescaler)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_ADCDACPRE, Prescaler);
}

/**
  * @brief  Configure DACSH kernel clock source.
  * @rmtoll
  *  CCIPR2         DACSEL         LL_RCC_SetDACSHClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSI
  */
__STATIC_INLINE void LL_RCC_SetDACSHClockSource(uint32_t clk_src)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_DACSEL, clk_src);
}

/**
  * @brief  Configure LPTIMx clock source.
  * @rmtoll
  *  CCIPR2         LPTIM1SEL         LL_RCC_SetLPTIMClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  */
__STATIC_INLINE void LL_RCC_SetLPTIMClockSource(uint32_t clk_src)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_LPTIM1SEL, clk_src);
}

/**
  * @brief  Configure CKx clock source.
  * @rmtoll
  *  CCIPR2         CK48SEL         LL_RCC_SetCK48ClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CK48_CLKSOURCE_PSIDIV3
  *         @arg @ref LL_RCC_CK48_CLKSOURCE_HSIDIV3
  *         @arg @ref LL_RCC_CK48_CLKSOURCE_HSE
  */
__STATIC_INLINE void LL_RCC_SetCK48ClockSource(uint32_t clk_src)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_CK48SEL, clk_src);
}

#if defined(XSPI1)
/* @brief  Configure XSPIx clock source.
  * @rmtoll
  *  CCIPR3         XSPI1SEL         LL_RCC_SetXSPIClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HSIK
  */
__STATIC_INLINE void LL_RCC_SetXSPIClockSource(uint32_t clk_src)
{
  LL_RCC_SetClockSource(clk_src);
}

#endif /* XSPI1 */
#if defined(ETH1)
/**
  * @brief  Configure ETH1x clock source.
  * @rmtoll
  *  CCIPR3         ETH1REFCLKSEL        LL_RCC_SetETH1ClockSource \n
  *  CCIPR3         ETH1PTPCLKSEL        LL_RCC_SetETH1ClockSource \n
  *  CCIPR3         ETH1CLKSEL           LL_RCC_SetETH1ClockSource
  * @param  clk_src This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_RMII
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_FB
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_HSE
  */
__STATIC_INLINE void LL_RCC_SetETH1ClockSource(uint32_t clk_src)
{
  LL_RCC_SetClockSource(clk_src);
}

/**
  * @brief  Configure ETH1 clock prescaler.
  * @rmtoll
  *  CCIPR3         ETH1CLKDIVSEL         LL_RCC_SetETH1Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_PRESCALER_1
  *         @arg @ref LL_RCC_ETH1_PRESCALER_2
  *         @arg @ref LL_RCC_ETH1_PRESCALER_4
  */
__STATIC_INLINE void LL_RCC_SetETH1Prescaler(uint32_t Prescaler)
{
  STM32_MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_ETH1CLKDIV, Prescaler);
}

/**
  * @brief  Configure ETH1PTP clock prescaler.
  * @rmtoll
  *  CCIPR3         ETH1PTPDIV         LL_RCC_SetETH1PTPPrescaler
  * @param prescaler parameter can be a value between 1 and 16
  */
__STATIC_INLINE void LL_RCC_SetETH1PTPPrescaler(uint32_t prescaler)
{
  STM32_MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_ETH1PTPDIV, ((prescaler - 1U) << RCC_CCIPR3_ETH1PTPDIV_Pos));
}

#endif /* ETH1 */
/**
  * @brief  Configure ADCDACx.
  * @rmtoll
  *  CCIPR2         ADCDACSEL        LL_RCC_ConfigADCDAC \n
  *  CCIPR2         ADCDACPRE        LL_RCC_ConfigADCDAC
  * @param  adcdacx_source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HSIK
  * @param  adcdacx_prescaler This parameter can be between the following values:
  *         @arg @ref LL_RCC_ADCDAC_PRESCALER_1
  *         @arg @ref LL_RCC_ADCDAC_PRESCALER_128
  * @note These bits can be written only if the ADCDAC clock is disabled.
  */
__STATIC_INLINE void LL_RCC_ConfigADCDAC(uint32_t adcdacx_source, uint32_t adcdacx_prescaler)
{
  STM32_MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_ADCDACSEL | RCC_CCIPR2_ADCDACPRE, adcdacx_source | adcdacx_prescaler);
}

/**
  * @brief  Get ADCDACx configuration.
  * @rmtoll
  *  CCIPR2         ADCDACSEL        LL_RCC_GetConfigADCDAC \n
  *  CCIPR2         ADCDACPRE        LL_RCC_GetConfigADCDAC
  * @param  p_adcdacx_source Pointer on LL_RCC_ADCDAC_CLKSOURCE
  * @param  p_adcdacx_prescaler Pointer on LL_RCC_ADCDAC_PRESCALER
  */
__STATIC_INLINE void LL_RCC_GetConfigADCDAC(uint32_t *p_adcdacx_source, uint32_t *p_adcdacx_prescaler)
{
  const volatile uint32_t Reg = STM32_READ_REG(RCC->CCIPR2);

  *p_adcdacx_source = (uint32_t)(Reg & RCC_CCIPR2_ADCDACSEL);
  *p_adcdacx_prescaler = (uint32_t)(Reg & RCC_CCIPR2_ADCDACPRE);
}

