MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
#if defined(ETH1)
/**
  * @brief  Configure ETH1.
  * @rmtoll
  *  CCIPR3         ETH1CLKSEL        LL_RCC_ConfigETH1 \n
  *  CCIPR3         ETH1CLKDIV        LL_RCC_ConfigETH1
  * @param  eth_source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_HSE
  * @param  eth_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_PRESCALER_1
  *         @arg @ref LL_RCC_ETH1_PRESCALER_2
  *         @arg @ref LL_RCC_ETH1_PRESCALER_4

  */
__STATIC_INLINE void LL_RCC_ConfigETH1(uint32_t eth_source, uint32_t eth_prescaler)
{
  STM32_MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_ETH1CLKSEL | RCC_CCIPR3_ETH1CLKDIV,
                   (LL_CLKSOURCE_CONFIG(eth_source)) | eth_prescaler);
}

/**
  * @brief  Get ETH1 configuration.
  * @rmtoll
  *  CCIPR3         ETH1CLKSEL        LL_RCC_GetConfigETH1 \n
  *  CCIPR3         ETH1CLKDIV        LL_RCC_GetConfigETH1
  * @param  p_eth_source Pointer on LL_RCC_ETH1_CLKSOURCE
  * @param  p_eth_prescaler Pointer on LL_RCC_ETH1_PRESCALER
  */
__STATIC_INLINE void LL_RCC_GetConfigETH1(uint32_t *p_eth_source, uint32_t *p_eth_prescaler)
{
  const volatile uint32_t Reg = STM32_READ_REG(RCC->CCIPR3);
  *p_eth_source = (uint32_t)LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1CLKSEL_Pos,
                                         RCC_CCIPR3_ETH1CLKSEL, (Reg & RCC_CCIPR3_ETH1CLKSEL)) ;
  *p_eth_prescaler = (uint32_t)(Reg & RCC_CCIPR3_ETH1CLKDIV);
}

/**
  * @brief  Configure ETH1PTP.
  * @rmtoll
  *  CCIPR3         ETH1PTPCLKSEL        LL_RCC_ConfigETH1PTP \n
  *  CCIPR3         ETH1PTPDIV           LL_RCC_ConfigETH1PTP
  * @param  ethptp_source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIK
  * @param  ethptp_prescaler parameter can be a value between 1 and 16
  */
__STATIC_INLINE void LL_RCC_ConfigETH1PTP(uint32_t ethptp_source, uint32_t ethptp_prescaler)
{
  STM32_MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_ETH1PTPCLKSEL | RCC_CCIPR3_ETH1PTPDIV,
                   (LL_CLKSOURCE_CONFIG(ethptp_source))
                   | ((ethptp_prescaler - 1U) << RCC_CCIPR3_ETH1PTPDIV_Pos));
}
/**
  * @brief  Get ETH1 PTPconfiguration.
  * @rmtoll
  *  CCIPR3         ETH1PTPCLKSEL        LL_RCC_GetConfigETH1PTP \n
  *  CCIPR3         ETH1PTPDIV           LL_RCC_GetConfigETH1PTP
  * @param  p_eth_source Pointer on LL_RCC_ETH1PTP_CLKSOURCE
  * @param  p_eth_prescaler Pointer on prescaler
  */
__STATIC_INLINE void LL_RCC_GetConfigETH1PTP(uint32_t *p_eth_source, uint32_t *p_eth_prescaler)
{
  const volatile uint32_t Reg = STM32_READ_REG(RCC->CCIPR3);

  *p_eth_source = (uint32_t)LL_CLKSOURCE(RCC_OFFSET_CCIPR3, (uint32_t)RCC_CCIPR3_ETH1PTPCLKSEL_Pos,
                                         RCC_CCIPR3_ETH1PTPCLKSEL, (Reg & RCC_CCIPR3_ETH1PTPCLKSEL)) ;
  *p_eth_prescaler = (uint32_t)(((Reg & RCC_CCIPR3_ETH1PTPDIV) >>  RCC_CCIPR3_ETH1PTPDIV_Pos) + 1U);
}

#endif /* ETH1 */
/**
  * @brief  Get periph clock source.
  * @rmtoll
  *  CCIPR1         *         LL_RCC_GetClockSource \n
  *  CCIPR2         *         LL_RCC_GetClockSource \n
  *  CCIPR3         *         LL_RCC_GetClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  * @if USART3
  *         @arg @ref LL_RCC_USART3_CLKSOURCE       (*)
  * @endif
  * @if USART6
  *         @arg @ref LL_RCC_USART6_CLKSOURCE       (*)
  * @endif
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE
  * @if UART7
  *         @arg @ref LL_RCC_UART7_CLKSOURCE        (*)
  * @endif
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE
  * @if SPI3
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE         (*)
  * @endif
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE
  * @if I2C2
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE         (*)
  * @endif
  * @if XSPI1
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE        (*)
  * @endif
  * @if ETH1
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE       (*)
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE       (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE          (*)
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_LSE
  * @if USART3
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSIK  (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE   (*)
  * @endif
  * @if USART6
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_LSE   (*)
  * @endif
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_LSE
  * @if UART7
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PCLK1  (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_HSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_LSE    (*)
  * @endif
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_AUDIOCLK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_AUDIOCLK
  * @if SPI3
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1     (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PSIK     (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_HSIK     (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_AUDIOCLK (*)
  * @endif
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_HSIK
  * @if I2C2
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_HSIK  (*)
  * @endif
  * @if ETH1
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_RMII  (*)
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_FB    (*)
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_HCLK  (*)
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIS  (*)
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_NONE     (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIS     (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIK     (*)
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_HSE      (*)
  * @endif
  * @if XSPI1
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HCLK    (*)
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_PSIK    (*)
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HSIK    (*)
  * @endif
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t LL_RCC_GetClockSource(uint32_t Periph)
{
  const volatile uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&RCC->CCIPR1) + LL_CLKSOURCE_REG(Periph)));
  return (uint32_t)(Periph | (((STM32_READ_BIT(*pReg, LL_CLKSOURCE_MASK(Periph))) >> LL_CLKSOURCE_POS(Periph)) \
                              << LL_RCC_CONFIG_SHIFT));
}
/**
  * @brief  Get USARTx clock source.
  * @rmtoll
  *  CCIPR1         USART1SEL         LL_RCC_GetUSARTClockSource \n
  *  CCIPR1         USART2SEL         LL_RCC_GetUSARTClockSource \n
  *  CCIPR1         USART3SEL         LL_RCC_GetUSARTClockSource \n
  *  CCIPR1         USART6SEL         LL_RCC_GetUSARTClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  * @if USART3
  *         @arg @ref LL_RCC_USART3_CLKSOURCE (*)
  * @endif
  * @if USART6
  *         @arg @ref LL_RCC_USART6_CLKSOURCE (*)
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_LSE
  * @if USART3
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSIK  (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE   (*)
  * @endif
  * @if USART6
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSIK  (*)
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_LSE   (*)
  * @endif
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSARTClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}
/**
  * @brief  Get UARTx clock source.
  * @rmtoll
  *  CCIPR1         UART4SEL         LL_RCC_GetUARTClockSource \n
  *  CCIPR1         UART5SEL         LL_RCC_GetUARTClockSource \n
  *  CCIPR1         UART7SEL         LL_RCC_GetUARTClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE
  * @if UART7
  *         @arg @ref LL_RCC_UART7_CLKSOURCE (*)
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_LSE
  * @if UART7
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PCLK1  (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_HSIK   (*)
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_LSE    (*)
  * @endif
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t LL_RCC_GetUARTClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}
/**
  * @brief  Get LPUARTx clock source.
  * @rmtoll
  *  CCIPR1         LPUART1SEL         LL_RCC_GetLPUARTClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUARTClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR1, RCC_CCIPR1_LPUART1SEL));
}
/**
  * @brief  Get SPIx clock source.
  * @rmtoll
  *  CCIPR1         SPI1SEL         LL_RCC_GetSPIClockSource \n
  *  CCIPR1         SPI2SEL         LL_RCC_GetSPIClockSource \n
  *  CCIPR1         SPI3SEL         LL_RCC_GetSPIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE
  * @if SPI3
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_AUDIOCLK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_AUDIOCLK
  * @if SPI3
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1     (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PSIK      (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_HSIK      (*)
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_AUDIOCLK  (*)
  * @endif
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPIClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}
#if defined(FDCAN1)

/**
  * @brief  Get FDCANx clock source.
  * @rmtoll
  *  CCIPR1         FDCANSEL         LL_RCC_GetFDCANClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetFDCANClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR1, RCC_CCIPR1_FDCANSEL));
}

#endif /* FDCAN1 */
/**
  * @brief  Get I2Cx clock source.
  * @rmtoll
  *  CCIPR2         I2C1SEL         LL_RCC_GetI2CClockSource \n
  *  CCIPR2         I2C2SEL         LL_RCC_GetI2CClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE
  * @if I2C2
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_HSIK
  * @if I2C2
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1  (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PSIK   (*)
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_HSIK   (*)
  * @endif
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2CClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}
/**
  * @brief  Get I3Cx clock source.
  * @rmtoll
  *  CCIPR2         I3C1SEL         LL_RCC_GetI3CClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_HSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3CClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR2, RCC_CCIPR2_I3C1SEL));
}
/**
  * @brief  Get ADCDACx clock source.
  * @rmtoll
  *  CCIPR2         ADCDACSEL         LL_RCC_GetADCDACClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCDACClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ADCDACSEL));
}

/**
  * @brief  Get ADCDACx clock prescaler.
  * @rmtoll
  *  CCIPR2         ADCDACSEL         LL_RCC_GetADCDACPrescaler
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE
  * @retval Returned value can be between the following values:
  *         @arg @ref LL_RCC_ADCDAC_PRESCALER_1
  *         @arg @ref LL_RCC_ADCDAC_PRESCALER_128
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCDACPrescaler(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ADCDACPRE));
}

/**
  * @brief  Get DACSH kernel Clock Source.
  * @rmtoll
  *  CCIPR2         DACSEL         LL_RCC_GetDACSHClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetDACSHClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR2, RCC_CCIPR2_DACSEL));
}

/**
  * @brief  Get LPTIMx clock source.
  * @rmtoll
  *  CCIPR2         LPTIM1SEL         LL_RCC_GetLPTIMClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_HSIK
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIMClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR2, RCC_CCIPR2_LPTIM1SEL));
}
/**
  * @brief  Get CKx clock source.
  * @rmtoll
  *  CCIPR2         CK48SEL         LL_RCC_GetCKClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CK48_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_CK48_CLKSOURCE_PSIDIV3
  *         @arg @ref LL_RCC_CK48_CLKSOURCE_HSIDIV3
  *         @arg @ref LL_RCC_CK48_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCKClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR2, RCC_CCIPR2_CK48SEL));
}

#if defined(XSPI1)
/**
  * @brief  Get XSPIx clock source.
  * @rmtoll
  *  CCIPR3         XSPI1SEL         LL_RCC_GetXSPIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetXSPIClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

#endif /* XSPI1 */
#if defined(ETH1)
/**
  * @brief  Get ETH1 clock source.
  * @rmtoll
  *  CCIPR3         ETH1REFCLKSEL         LL_RCC_GetETH1ClockSource \n
  *  CCIPR3         ETH1PTPCLKSEL         LL_RCC_GetETH1ClockSource \n
  *  CCIPR3         ETH1CLKSEL            LL_RCC_GetETH1ClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_RMII
  *         @arg @ref LL_RCC_ETH1REF_CLKSOURCE_FB
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIS
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PSIK
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1ClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get ETH1 clock prescaler.
  * @rmtoll
  *  CCIPR3         ETH1CLKDIV            LL_RCC_GetETH1Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_PRESCALER_1
  *         @arg @ref LL_RCC_ETH1_PRESCALER_2
  *         @arg @ref LL_RCC_ETH1_PRESCALER_4
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1Prescaler(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->CCIPR3, RCC_CCIPR3_ETH1CLKDIV));
}

/**
  * @brief  Get ETH1PTP clock prescaler.
  * @rmtoll
  *  CCIPR3         ETH1PTPDIV         LL_RCC_GetETH1PTPPrescaler
  * @if ETH1
    * @retval Returned value can be a value between 1 and 16
  * @endif
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1PTPPrescaler(void)
{
  return (uint32_t)(((STM32_READ_BIT(RCC->CCIPR3, RCC_CCIPR3_ETH1PTPDIV)) >> RCC_CCIPR3_ETH1PTPDIV_Pos) + 1U);
}

#endif /* ETH1 */
/**
  * @}
  */ /* End of RCC_LL_EF_Peripheral_Clock_Source */

