MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/** @defgroup RCC_LL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Set RTC Clock Source.
  * @rmtoll
  *  RTCCR         RTCSEL         LL_RCC_SetRTCClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV
  * @note   Once the RTC clock source has been selected, it cannot be changed anymore unless
  *         the Backup domain is reset, or unless a failure is detected on LSE (LSECSSD is
  *         set). The VSWRST bit can be used to reset them.
  */
__STATIC_INLINE void LL_RCC_SetRTCClockSource(uint32_t Source)
{
  STM32_MODIFY_REG(RCC->RTCCR, RCC_RTCCR_RTCSEL, Source);
}

/**
  * @brief  Get RTC Clock Source.
  * @rmtoll
  *  RTCCR         RTCSEL         LL_RCC_GetRTCClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV
  */
__STATIC_INLINE uint32_t LL_RCC_GetRTCClockSource(void)
{
  return (uint32_t)(STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_RTCSEL));
}

/**
  * @brief  Enable RTC.
  * @rmtoll
  *  RTCCR         RTCEN         LL_RCC_EnableRTC
  */
__STATIC_INLINE void LL_RCC_EnableRTC(void)
{
  STM32_SET_BIT(RCC->RTCCR, RCC_RTCCR_RTCEN);
}

/**
  * @brief  Disable RTC.
  * @rmtoll
  *  RTCCR         RTCEN         LL_RCC_DisableRTC
  */
__STATIC_INLINE void LL_RCC_DisableRTC(void)
{
  STM32_CLEAR_BIT(RCC->RTCCR, RCC_RTCCR_RTCEN);
}

/**
  * @brief  Check if RTC has been enabled or not.
  * @rmtoll
  *  RTCCR         RTCEN         LL_RCC_IsEnabledRTC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledRTC(void)
{
  return ((STM32_READ_BIT(RCC->RTCCR, RCC_RTCCR_RTCEN) == (RCC_RTCCR_RTCEN)) ? 1UL : 0UL);
}

/**
  * @brief  Force the Backup domain reset.
  * @rmtoll
  *  RTCCR         RTCDRST         LL_RCC_ForceRTCDomainReset
  */
__STATIC_INLINE void LL_RCC_ForceRTCDomainReset(void)
{
  STM32_SET_BIT(RCC->RTCCR, RCC_RTCCR_RTCDRST);
}

/**
  * @brief  Release the Backup domain reset.
  * @rmtoll
  *  RTCCR         RTCDRST         LL_RCC_ReleaseRTCDomainReset
  */
__STATIC_INLINE void LL_RCC_ReleaseRTCDomainReset(void)
{
  STM32_CLEAR_BIT(RCC->RTCCR, RCC_RTCCR_RTCDRST);
}

/**
  * @brief  Get HSE Prescaler for RTC Clock.
  * @rmtoll
  *  CFGR1         RTCPRE         LL_RCC_GetRTC_HSEPrescaler
  * @retval Returned value can be a value between 1 and 511
  */
__STATIC_INLINE uint32_t LL_RCC_GetRTC_HSEPrescaler(void)
{
  return (uint32_t)((STM32_READ_BIT(RCC->CFGR1, RCC_CFGR1_RTCPRE)) >> RCC_CFGR1_RTCPRE_Pos);
}

/**
  * @brief Set HSE Prescaler for RTC Clock.
  * @rmtoll
  *  CFGR1         RTCPRE         LL_RCC_SetRTC_HSEPrescaler
  * @param prescaler parameter can be a value between 0 and 511 with 0 and 1 values meaning no clock output
  * @note prescaler must be correctly set to ensure that the clock supplied to the RTC is lower than 1MHz.
  */
__STATIC_INLINE void LL_RCC_SetRTC_HSEPrescaler(uint32_t prescaler)
{
  STM32_MODIFY_REG(RCC->CFGR1, RCC_CFGR1_RTCPRE, prescaler << RCC_CFGR1_RTCPRE_Pos);
}

/**
  * @}
  */ /* End of RCC_LL_EF_RTC */

/** @defgroup RCC_LL_EF_FLAG_Management FLAG Management
  * @{
  */
/**
  * @brief  Clear RCC interrupt flags.
  * @rmtoll
  *  CICR         LSIRDYC             LL_RCC_ClearFlag \n
  *  CICR         LSERDYC             LL_RCC_ClearFlag \n
  *  CICR         HSIRDYC             LL_RCC_ClearFlag \n
  *  CICR         HSIDIV3RDYC         LL_RCC_ClearFlag \n
  *  CICR         HSIKRDYC            LL_RCC_ClearFlag \n
  *  CICR         PSIRDYC             LL_RCC_ClearFlag \n
  *  CICR         PSIDIV3RDYC         LL_RCC_ClearFlag \n
  *  CICR         PSIKRDYC            LL_RCC_ClearFlag \n
  *  CICR         HSERDYC             LL_RCC_ClearFlag \n
  *  CICR         HSECSSC             LL_RCC_ClearFlag \n
  *  CICR         LSECSSC             LL_RCC_ClearFlag
  * @param  mask specifies the RCC flags to be cleared.
  *         This parameter can be any combination of the following values:
  *            @arg @ref LL_RCC_IT_LSIRDY
  *            @arg @ref LL_RCC_IT_LSERDY
  *            @arg @ref LL_RCC_IT_HSIRDY
  *            @arg @ref LL_RCC_IT_HSIDIV3RDY
  *            @arg @ref LL_RCC_IT_HSIKRDY
  *            @arg @ref LL_RCC_IT_PSIRDY
  *            @arg @ref LL_RCC_IT_PSIDIV3RDY
  *            @arg @ref LL_RCC_IT_PSIKRDY
  *            @arg @ref LL_RCC_IT_HSERDY
  *            @arg @ref LL_RCC_IT_HSECSS
  *            @arg @ref LL_RCC_IT_LSECSS
  */
__STATIC_INLINE void LL_RCC_ClearFlag(uint32_t mask)
{
  STM32_WRITE_REG(RCC->CICR, mask);
}
/**
  * @brief  Clear LSIRDY ready interrupt flag.
  * @rmtoll
  *  CICR         LSIRDYC         LL_RCC_ClearFlag_LSIRDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSIRDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_LSIRDYC);
}
/**
  * @brief  Clear LSERDY ready interrupt flag.
  * @rmtoll
  *  CICR         LSERDYC         LL_RCC_ClearFlag_LSERDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSERDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_LSERDYC);
}
/**
  * @brief  Clear HSIRDY ready interrupt flag.
  * @rmtoll
  *  CICR         HSIRDYC         LL_RCC_ClearFlag_HSIRDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSIRDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_HSISRDYC);
}
/**
  * @brief  Clear HSIDIV3RDY ready interrupt flag.
  * @rmtoll
  *  CICR         HSIDIV3RDYC         LL_RCC_ClearFlag_HSIDIV3RDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSIDIV3RDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_HSIDIV3RDYC);
}
/**
  * @brief  Clear HSIKRDY ready interrupt flag.
  * @rmtoll
  *  CICR         HSIKRDYC         LL_RCC_ClearFlag_HSIKRDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSIKRDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_HSIKRDYC);
}
/**
  * @brief  Clear PSIRDY ready interrupt flag.
  * @rmtoll
  *  CICR         PSIRDYC         LL_RCC_ClearFlag_PSIRDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PSIRDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_PSISRDYC);
}

/**
  * @brief  Clear PSIDIV3RDY ready interrupt flag.
  * @rmtoll
  *  CICR         PSIDIV3RDYC         LL_RCC_ClearFlag_PSIDIV3RDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PSIDIV3RDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_PSIDIV3RDYC);
}

/**
  * @brief  Clear PSIKRDY ready interrupt flag.
  * @rmtoll
  *  CICR         PSIKRDYC         LL_RCC_ClearFlag_PSIKRDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PSIKRDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_PSIKRDYC);
}
/**
  * @brief  Clear HSERDY ready interrupt flag.
  * @rmtoll
  *  CICR         HSERDYC         LL_RCC_ClearFlag_HSERDY
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSERDY(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_HSERDYC);
}
/**
  * @brief  Clear HSECSS ready interrupt flag.
  * @rmtoll
  *  CICR         HSECSSC         LL_RCC_ClearFlag_HSECSS
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSECSS(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_HSECSSC);
}

/**
  * @brief  Clear LSECSS ready interrupt flag.
  * @rmtoll
  *  CICR         LSECSSC         LL_RCC_ClearFlag_LSECSS
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSECSS(void)
{
  STM32_SET_BIT(RCC->CICR, RCC_CICR_LSECSSC);
}


/**
  * @brief  Check if RCC ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         LSIRDYF             LL_RCC_IsActiveFlag \n
  *  CIFR         LSERDYF             LL_RCC_IsActiveFlag \n
  *  CIFR         HSIRDYF             LL_RCC_IsActiveFlag \n
  *  CIFR         HSIDIV3RDYF         LL_RCC_IsActiveFlag \n
  *  CIFR         HSIKRDYF            LL_RCC_IsActiveFlag \n
  *  CIFR         PSIRDYF             LL_RCC_IsActiveFlag \n
  *  CIFR         PSIDIV3RDYF         LL_RCC_IsActiveFlag \n
  *  CIFR         PSIKRDYF            LL_RCC_IsActiveFlag \n
  *  CIFR         HSERDYF             LL_RCC_IsActiveFlag \n
  *  CIFR         HSECSSF             LL_RCC_IsActiveFlag \n
  *  CIFR         LSECSSF             LL_RCC_IsActiveFlag
  * @param  mask specifies the RCC flags to be cleared.
  *         This parameter can be any combination of the following values:
  *            @arg @ref LL_RCC_IT_LSIRDY
  *            @arg @ref LL_RCC_IT_LSERDY
  *            @arg @ref LL_RCC_IT_HSIRDY
  *            @arg @ref LL_RCC_IT_HSIDIV3RDY
  *            @arg @ref LL_RCC_IT_HSIKRDY
  *            @arg @ref LL_RCC_IT_PSIRDY
  *            @arg @ref LL_RCC_IT_PSIDIV3RDY
  *            @arg @ref LL_RCC_IT_PSIKRDY
  *            @arg @ref LL_RCC_IT_HSERDY
  *            @arg @ref LL_RCC_IT_HSECSS
  *            @arg @ref LL_RCC_IT_LSECSS
  * @retval State of flags (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag(uint32_t mask)
{
  return ((STM32_READ_BIT(RCC->CIFR, mask) == mask) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSIRDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         LSIRDYF         LL_RCC_IsActiveFlag_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSIRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_LSIRDYF) == RCC_CIFR_LSIRDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSERDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         LSERDYF         LL_RCC_IsActiveFlag_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSERDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_LSERDYF) == RCC_CIFR_LSERDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSIRDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         HSIRDYF         LL_RCC_IsActiveFlag_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSIRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_HSISRDYF) == RCC_CIFR_HSISRDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSIDIV3RDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         HSIDIV3RDYF         LL_RCC_IsActiveFlag_HSIDIV3RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSIDIV3RDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_HSIDIV3RDYF) == RCC_CIFR_HSIDIV3RDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSIKRDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         HSIKRDYF         LL_RCC_IsActiveFlag_HSIKRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSIKRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_HSIKRDYF) == RCC_CIFR_HSIKRDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if PSIRDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         PSIRDYF         LL_RCC_IsActiveFlag_PSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PSIRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_PSISRDYF) == RCC_CIFR_PSISRDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if PSIDIV3RDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         PSIDIV3RDYF         LL_RCC_IsActiveFlag_PSIDIV3RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PSIDIV3RDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_PSIDIV3RDYF) == RCC_CIFR_PSIDIV3RDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if PSIKRDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         PSIKRDYF         LL_RCC_IsActiveFlag_PSIKRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PSIKRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_PSIKRDYF) == RCC_CIFR_PSIKRDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSERDY ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         HSERDYF         LL_RCC_IsActiveFlag_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSERDY(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_HSERDYF) == RCC_CIFR_HSERDYF) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSECSS ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         HSECSSF         LL_RCC_IsActiveFlag_HSECSS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSECSS(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_HSECSSF) == RCC_CIFR_HSECSSF) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSECSS ready interrupt occurred or not.
  * @rmtoll
  *  CIFR         LSECSSF         LL_RCC_IsActiveFlag_LSECSS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSECSS(void)
{
  return ((STM32_READ_BIT(RCC->CIFR, RCC_CIFR_LSECSSF) == RCC_CIFR_LSECSSF) ? 1UL : 0UL);
}

/**
  * @brief  Set RMVF bit to clear the reset flags.
  * @rmtoll
  *  RSR          RMVF          LL_RCC_ForceClearResetFlags
  */
__STATIC_INLINE void LL_RCC_ForceClearResetFlags(void)
{
  STM32_SET_BIT(RCC->RSR, RCC_RSR_RMVF);
}

/**
  * @brief  Reset RMVF bit to release the clear of reset flags.
  * @rmtoll
  *  RSR          RMVF          LL_RCC_ReleaseClearResetFlags
  */
__STATIC_INLINE void LL_RCC_ReleaseClearResetFlags(void)
{
  STM32_CLEAR_BIT(RCC->RSR, RCC_RSR_RMVF);
}

/**
  * @brief  Check if RCC pin reset flag (NRST) is set or not.
  * @rmtoll
  *  RSR         PINRSTF         LL_RCC_IsActiveFlag_PINRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PINRST(void)
{
  return ((STM32_READ_BIT(RCC->RSR, RCC_RSR_PINRSTF) == RCC_RSR_PINRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC POR reset flag is set or not.
  * @rmtoll
  *  RSR         BORRSTF         LL_RCC_IsActiveFlag_BORRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_BORRST(void)
{
  return ((STM32_READ_BIT(RCC->RSR, RCC_RSR_BORRSTF) == RCC_RSR_BORRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC system reset from CPU reset flag is set or not.
  * @rmtoll
  *  RSR         SFTRSTF         LL_RCC_IsActiveFlag_SFTRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_SFTRST(void)
{
  return ((STM32_READ_BIT(RCC->RSR, RCC_RSR_SFTRSTF) == RCC_RSR_SFTRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC independent watchdog reset flag is set or not.
  * @rmtoll
  *  RSR         IWDGRSTF         LL_RCC_IsActiveFlag_IWDGRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_IWDGRST(void)
{
  return ((STM32_READ_BIT(RCC->RSR, RCC_RSR_IWDGRSTF) == RCC_RSR_IWDGRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC window watchdog reset flag is set or not.
  * @rmtoll
  *  RSR         WWDGRSTF         LL_RCC_IsActiveFlag_WWDGRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_WWDGRST(void)
{
  return ((STM32_READ_BIT(RCC->RSR, RCC_RSR_WWDGRSTF) == RCC_RSR_WWDGRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC Low-power reset flag is set or not.
  * @rmtoll
  *  RSR         LPWRRSTF         LL_RCC_IsActiveFlag_LPWRRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LPWRRST(void)
{
  return ((STM32_READ_BIT(RCC->RSR, RCC_RSR_LPWRRSTF) == RCC_RSR_LPWRRSTF) ? 1UL : 0UL);
}

/**
  * @}
  */ /* End of RCC_LL_EF_FLAG_Management */

/** @defgroup RCC_LL_EF_Privilege_Services Privilege Services
  * @{
  */

/**
  * @brief  Set the privileged access level attribute for item(s).
  * @rmtoll PRIVCFGR     PRIV          LL_RCC_SetPrivAttr
  * @param  item This parameter can be a combination of the following values:
  *         @arg @ref LL_RCC_PRIV_ITEM_ALL
  * @param priv_attr This parameter can be one of the following values:
  *        @arg @ref LL_RCC_ATTR_PRIV
  */
__STATIC_INLINE void LL_RCC_SetPrivAttr(uint32_t item, uint32_t priv_attr)
{
  STM32_MODIFY_REG(RCC->PRIVCFGR, item, (item * priv_attr));
}

/**
  * @brief  Get the privileged access level attribute of an item.
  * @rmtoll PRIVCFGR     PRIV         LL_RCC_GetPrivAttr
  * @param  item This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PRIV_ITEM_ALL
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ATTR_PRIV
  */
__STATIC_INLINE uint32_t LL_RCC_GetPrivAttr(uint32_t item)
{
  return ((STM32_READ_BIT(RCC->PRIVCFGR, item) == (item)) ? LL_RCC_ATTR_PRIV : LL_RCC_ATTR_NPRIV);
}

/**
  * @}
  */ /* RCC_LL_EF_Privilege_Services */

/** @defgroup RCC_LL_EF_IT_Management IT Management
  * @{
  */

/**
  * @brief  Enable RCC interrupts.
  * @rmtoll
  *  CIER         LSIRDYIE             LL_RCC_EnableIT \n
  *  CIER         LSERDYIE             LL_RCC_EnableIT \n
  *  CIER         HSIRDYIE             LL_RCC_EnableIT \n
  *  CIER         HSIDIV3RDYIE         LL_RCC_EnableIT \n
  *  CIER         HSIKRDYIE            LL_RCC_EnableIT \n
  *  CIER         PSIRDYIE             LL_RCC_EnableIT \n
  *  CIER         PSIDIV3RDYIE         LL_RCC_EnableIT \n
  *  CIER         PSIKRDYIE            LL_RCC_EnableIT \n
  *  CIER         HSERDYIE             LL_RCC_EnableIT
  * @param  mask specifies the RCC IT to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg @ref LL_RCC_IT_LSIRDY
  *            @arg @ref LL_RCC_IT_LSERDY
  *            @arg @ref LL_RCC_IT_HSIRDY
  *            @arg @ref LL_RCC_IT_HSIDIV3RDY
  *            @arg @ref LL_RCC_IT_HSIKRDY
  *            @arg @ref LL_RCC_IT_PSIRDY
  *            @arg @ref LL_RCC_IT_PSIDIV3RDY
  *            @arg @ref LL_RCC_IT_PSIKRDY
  *            @arg @ref LL_RCC_IT_HSERDY
  */
__STATIC_INLINE void LL_RCC_EnableIT(uint32_t mask)
{
  STM32_SET_BIT(RCC->CIER, mask);
}

/**
  * @brief  Enable LSI ready interrupt.
  * @rmtoll
  *  CIER         LSIRDYIE         LL_RCC_EnableIT_LSIRDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSIRDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_LSIRDYIE);
}

/**
  * @brief  Enable LSE ready interrupt.
  * @rmtoll
  *  CIER         LSERDYIE         LL_RCC_EnableIT_LSERDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSERDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_LSERDYIE);
}

/**
  * @brief  Enable HSI ready interrupt.
  * @rmtoll
  *  CIER         HSIRDYIE         LL_RCC_EnableIT_HSIRDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSIRDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_HSISRDYIE);
}

/**
  * @brief  Enable HSIDIV3 ready interrupt.
  * @rmtoll
  *  CIER         HSIDIV3RDYIE         LL_RCC_EnableIT_HSIDIV3RDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSIDIV3RDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_HSIDIV3RDYIE);
}


/**
  * @brief  Enable HSIK ready interrupt.
  * @rmtoll
  *  CIER         HSIKRDYIE         LL_RCC_EnableIT_HSIKRDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSIKRDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_HSIKRDYIE);
}

/**
  * @brief  Enable PSI ready interrupt.
  * @rmtoll
  *  CIER         PSIRDYIE         LL_RCC_EnableIT_PSIRDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_PSIRDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_PSISRDYIE);
}

/**
  * @brief  Enable PSIDIV3 ready interrupt.
  * @rmtoll
  *  CIER         PSIDIV3RDYIE         LL_RCC_EnableIT_PSIDIV3RDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_PSIDIV3RDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_PSIDIV3RDYIE);
}

/**
  * @brief  Enable PSIK ready interrupt.
  * @rmtoll
  *  CIER         PSIKRDYIE         LL_RCC_EnableIT_PSIKRDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_PSIKRDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_PSIKRDYIE);
}

/**
  * @brief  Enable HSE ready interrupt.
  * @rmtoll
  *  CIER         HSERDYIE         LL_RCC_EnableIT_HSERDY
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSERDY(void)
{
  STM32_SET_BIT(RCC->CIER, RCC_CIER_HSERDYIE);
}


/**
  * @brief  Disable RCC interrupts.
  * @rmtoll
  *  CIER         LSIRDYIE             LL_RCC_DisableIT \n
  *  CIER         LSERDYIE             LL_RCC_DisableIT \n
  *  CIER         HSIRDYIE             LL_RCC_DisableIT \n
  *  CIER         HSIDIV3RDYIE         LL_RCC_DisableIT \n
  *  CIER         HSIKRDYIE            LL_RCC_DisableIT \n
  *  CIER         PSIRDYIE             LL_RCC_DisableIT \n
  *  CIER         PSIDIV3RDYIE         LL_RCC_DisableIT \n
  *  CIER         PSIKRDYIE            LL_RCC_DisableIT \n
  *  CIER         HSERDYIE             LL_RCC_DisableIT
  * @param  mask specifies the RCC IT to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg @ref LL_RCC_IT_LSIRDY
  *            @arg @ref LL_RCC_IT_LSERDY
  *            @arg @ref LL_RCC_IT_HSIRDY
  *            @arg @ref LL_RCC_IT_HSIDIV3RDY
  *            @arg @ref LL_RCC_IT_HSIKRDY
  *            @arg @ref LL_RCC_IT_PSIRDY
  *            @arg @ref LL_RCC_IT_PSIDIV3RDY
  *            @arg @ref LL_RCC_IT_PSIKRDY
  *            @arg @ref LL_RCC_IT_HSERDY
  */
__STATIC_INLINE void LL_RCC_DisableIT(uint32_t mask)
{
  STM32_CLEAR_BIT(RCC->CIER, mask);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         LSIRDYIE         LL_RCC_DisableIT_LSIRDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSIRDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_LSIRDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         LSERDYIE         LL_RCC_DisableIT_LSERDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSERDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_LSERDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         HSIRDYIE         LL_RCC_DisableIT_HSIRDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSIRDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_HSISRDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         HSIDIV3RDYIE         LL_RCC_DisableIT_HSIDIV3RDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSIDIV3RDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_HSIDIV3RDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         HSIKRDYIE         LL_RCC_DisableIT_HSIKRDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSIKRDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_HSIKRDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         PSIRDYIE         LL_RCC_DisableIT_PSIRDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_PSIRDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_PSISRDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         PSIDIV3RDYIE         LL_RCC_DisableIT_PSIDIV3RDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_PSIDIV3RDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_PSIDIV3RDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         PSIKRDYIE         LL_RCC_DisableIT_PSIKRDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_PSIKRDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_PSIKRDYIE);
}

/**
  * @brief  Disable LSI ready interrupt.
  * @rmtoll
  *  CIER         HSERDYIE         LL_RCC_DisableIT_HSERDY
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSERDY(void)
{
  STM32_CLEAR_BIT(RCC->CIER, RCC_CIER_HSERDYIE);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         LSIRDYIE         LL_RCC_IsEnabledIT_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSIRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_LSIRDYIE) == RCC_CIER_LSIRDYIE) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         LSERDYIE         LL_RCC_IsEnabledIT_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSERDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_LSERDYIE) == RCC_CIER_LSERDYIE) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         HSIRDYIE         LL_RCC_IsEnabledIT_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSIRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_HSISRDYIE) == RCC_CIER_HSISRDYIE) ? 1UL : 0UL);
}

