MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rcc.h
/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         HSIDIV3RDYIE         LL_RCC_IsEnabledIT_HSIDIV3RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSIDIV3RDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_HSIDIV3RDYIE) == RCC_CIER_HSIDIV3RDYIE) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         HSIKRDYIE         LL_RCC_IsEnabledIT_HSIKRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSIKRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_HSIKRDYIE) == RCC_CIER_HSIKRDYIE) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         PSIRDYIE         LL_RCC_IsEnabledIT_PSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PSIRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_PSISRDYIE) == RCC_CIER_PSISRDYIE) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         PSIDIV3RDYIE         LL_RCC_IsEnabledIT_PSIDIV3RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PSIDIV3RDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_PSIDIV3RDYIE) == RCC_CIER_PSIDIV3RDYIE) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         PSIKRDYIE         LL_RCC_IsEnabledIT_PSIKRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PSIKRDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_PSIKRDYIE) == RCC_CIER_PSIKRDYIE) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI ready interrupt source is enabled or disabled.
  * @rmtoll
  *  CIER         HSERDYIE         LL_RCC_IsEnabledIT_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSERDY(void)
{
  return ((STM32_READ_BIT(RCC->CIER, RCC_CIER_HSERDYIE) == RCC_CIER_HSERDYIE) ? 1UL : 0UL);
}

/**
  * @}
  */ /* End of RCC_LL_EF_IT_Management */

/**
  * @}
  */ /* RCC_LL_Exported_Functions */

/**
  * @}
  */ /* End of RCC_LL */

#endif /* RCC */

/**
  * @}
  */ /* End of STM32C5XX_LL_Driver */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_RCC_H */
